<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>ConsentText</key>
	<dict>
		<key>default</key>
		<string>The Calendar Logging profile generates files that allow Apple to troubleshoot issues associated with your device and Calendar, and helps Apple improve related products and services. The generated files may include information related to your use of Calendar and Reminders, including any event titles, locations, notes, and contact information, including email and calendar account details and the contents of your contacts, calendars, notes, reminders, bookmarks, and emails sent to or from the device. The profile will expire after 4 days.

You may turn off logging at any time by deleting the profile. To turn off logging on your iOS device, open Settings, tap General, tap "Profiles &amp; Device Management," tap "Calendar Logging" and tap "Delete Profile."  

By enabling this diagnostic tool and sending a copy of the generated files to Apple, you are consenting to Apple's use of the content of such files in accordance with its privacy policy (http://www.apple.com/legal/privacy).

Apple Confidential Profile. Do not distribute. Not to be used or disclosed without permission from Apple. Copyright © 2024, Apple Inc. All rights reserved.</string>
	</dict>
	<key>DurationUntilRemoval</key>
	<real>345600.0</real>
	<key>PayloadContent</key>
	<array>
		<dict>
			<key>PayloadContent</key>
			<array>
				<dict>
					<key>DefaultsData</key>
					<dict>
						<key>DADiagnosticsEnabled</key>
						<true/>
						<key>DALogLevel</key>
						<integer>6</integer>
						<key>DAOutputLevel</key>
						<integer>6</integer>
					</dict>
					<key>DefaultsDomainName</key>
					<string>.GlobalPreferences</string>
				</dict>
			</array>
			<key>PayloadIdentifier</key>
			<string>com.apple.defaults.managed.a8f5404e-2ae9-40f5-a8f0-827d27fbc4a0</string>
			<key>PayloadType</key>
			<string>com.apple.defaults.managed</string>
			<key>PayloadUUID</key>
			<string>a8f5404e-2ae9-40f5-a8f0-827d27fbc4a0</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
		</dict>
		<dict>
			<key>PayloadDisplayName</key>
			<string>Calendar Logging</string>
			<key>PayloadEnabled</key>
			<true/>
			<key>PayloadIdentifier</key>
			<string>com.apple.system.logging.23b4745d-0f7a-45fd-a877-0a96e01de8ce</string>
			<key>PayloadType</key>
			<string>com.apple.system.logging</string>
			<key>PayloadUUID</key>
			<string>23b4745d-0f7a-45fd-a877-0a96e01de8ce</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
			<key>Processes</key>
			<dict>
				<key>com.apple.mobilecal</key>
				<dict>
					<key>Level</key>
					<dict>
						<key>Enable</key>
						<string>Debug</string>
						<key>Persist</key>
						<string>Debug</string>
					</dict>
				</dict>
			</dict>
			<key>Subsystems</key>
			<dict>
				<key>com.apple.calendar</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Default-Privacy-Setting</key>
						<string>Public</string>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Debug</string>
							<key>Persist</key>
							<string>Debug</string>
						</dict>
						<key>TTL</key>
						<dict>
							<key>Debug</key>
							<integer>30</integer>
							<key>Default</key>
							<integer>30</integer>
							<key>Info</key>
							<integer>30</integer>
						</dict>
					</dict>
				</dict>
				<key>com.apple.calendar.daemon</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Default-Privacy-Setting</key>
						<string>Public</string>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Debug</string>
							<key>Persist</key>
							<string>Debug</string>
						</dict>
						<key>TTL</key>
						<dict>
							<key>Debug</key>
							<integer>30</integer>
							<key>Default</key>
							<integer>30</integer>
							<key>Info</key>
							<integer>30</integer>
						</dict>
					</dict>
				</dict>
				<key>com.apple.calendar.database</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Default-Privacy-Setting</key>
						<string>Public</string>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Debug</string>
							<key>Persist</key>
							<string>Debug</string>
						</dict>
						<key>TTL</key>
						<dict>
							<key>Debug</key>
							<integer>30</integer>
							<key>Default</key>
							<integer>30</integer>
							<key>Info</key>
							<integer>30</integer>
						</dict>
					</dict>
				</dict>
				<key>com.apple.calendar.notification</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Default-Privacy-Setting</key>
						<string>Public</string>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Debug</string>
							<key>Persist</key>
							<string>Debug</string>
						</dict>
						<key>TTL</key>
						<dict>
							<key>Debug</key>
							<integer>30</integer>
							<key>Default</key>
							<integer>30</integer>
							<key>Info</key>
							<integer>30</integer>
						</dict>
					</dict>
				</dict>
				<key>com.apple.dataaccess</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Default-Privacy-Setting</key>
						<string>Public</string>
						<key>Enable-Oversize-Messages</key>
						<true/>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Debug</string>
							<key>Persist</key>
							<string>Info</string>
						</dict>
						<key>TTL</key>
						<dict>
							<key>Debug</key>
							<integer>0</integer>
							<key>Default</key>
							<integer>7</integer>
							<key>Info</key>
							<integer>7</integer>
						</dict>
					</dict>
				</dict>
				<key>com.apple.eventkit</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Default-Privacy-Setting</key>
						<string>Public</string>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Debug</string>
							<key>Persist</key>
							<string>Debug</string>
						</dict>
						<key>TTL</key>
						<dict>
							<key>Debug</key>
							<integer>30</integer>
							<key>Default</key>
							<integer>30</integer>
							<key>Info</key>
							<integer>30</integer>
						</dict>
					</dict>
				</dict>
			</dict>
		</dict>
	</array>
	<key>PayloadDescription</key>
	<string>Enabled additional logging for Calendar and Reminders</string>
	<key>PayloadDisplayName</key>
	<string>Calendar and Reminders Logging</string>
	<key>PayloadIdentifier</key>
	<string>com.apple.system.logging.calendar</string>
	<key>PayloadOrganization</key>
	<string>Apple Inc.</string>
	<key>PayloadRemovalDisallowed</key>
	<false/>
	<key>PayloadScope</key>
	<string>system</string>
	<key>PayloadType</key>
	<string>Configuration</string>
	<key>PayloadUUID</key>
	<string>62EEB01C-2F48-4A95-B7E2-353825011C3D</string>
	<key>PayloadVersion</key>
	<integer>1</integer>
	<key>RemovalDate</key>
	<date>2025-08-02T07:00:00Z</date>
</dict>
</plist>
