<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>ConsentText</key>
	<dict>
		<key>default</key>
		<string>The Check In logging profile generates files that allow Apple to troubleshoot issues with Check In and help Apple to improve its products and services. The generated files may contain some of your personal information, including your Apple ID and information about your activities on the device such as playing music, using Siri, and interacting with HomeKit. The content of such activities will not be included.

If you install this profile, it will automatically turn logging on, and this data will be captured when you take a Sysdiagnose on the device. The data will not leave the device unless you initiate a Sysdiagnose and send the results. The profile will expire after 3 days.

You will be able to turn on and off logging at any time while the Profile is installed. To turn off logging on your iOS device, open Settings, tap General, tap "Profiles," tap "Check In Logging," and tap "Delete Profile."

By enabling this diagnostic tool and sending a copy of the generated files to Apple, you are consenting to Apple's use of the content of such files in accordance with its privacy policy (http://www.apple.com/legal/privacy).
        

Apple Confidential Profile. Do not distribute. Not to be used or disclosed without permission from Apple. Copyright © 2024, Apple Inc. All rights reserved.</string>
	</dict>
	<key>DurationUntilRemoval</key>
	<real>259200.0</real>
	<key>PayloadContent</key>
	<array>
		<dict>
			<key>PayloadIdentifier</key>
			<string>com.apple.intercom.loggingprofile.1</string>
			<key>PayloadType</key>
			<string>com.apple.system.logging</string>
			<key>PayloadUUID</key>
			<string>EC5D2DEC-FD02-11EA-ADC1-0242AC120002</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
			<key>Subsystems</key>
			<dict>
				<key>com.apple.dropin</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Default-Privacy-Setting</key>
						<string>Public</string>
					</dict>
				</dict>
				<key>com.apple.intercom</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Default-Privacy-Setting</key>
						<string>Public</string>
					</dict>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>PayloadIdentifier</key>
			<string>com.apple.HomeKitDeveloperLoggingProfile.HomeKit</string>
			<key>PayloadType</key>
			<string>com.apple.system.logging</string>
			<key>PayloadUUID</key>
			<string>5B1C7DEF-E7CA-4DEA-BDBF-A2E75041935C</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
			<key>Subsystems</key>
			<dict>
				<key>com.apple.HomeKit</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Enable-Oversize-Messages</key>
						<true/>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Info</string>
							<key>Persist</key>
							<string>Info</string>
						</dict>
						<key>Privacy-Enable-Level</key>
						<string>Private</string>
					</dict>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>PayloadIdentifier</key>
			<string>com.apple.HomeKitDeveloperLoggingProfile.HomeFramework</string>
			<key>PayloadType</key>
			<string>com.apple.system.logging</string>
			<key>PayloadUUID</key>
			<string>1822D95A-F159-4AD3-B5B7-FABC9ED5B3E6</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
			<key>Subsystems</key>
			<dict>
				<key>com.apple.Home.framework</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Enable-Oversize-Messages</key>
						<true/>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Info</string>
							<key>Persist</key>
							<string>Info</string>
						</dict>
						<key>Privacy-Enable-Level</key>
						<string>Private</string>
					</dict>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>PayloadIdentifier</key>
			<string>com.apple.HomeKitDeveloperLoggingProfile.CoreHAP</string>
			<key>PayloadType</key>
			<string>com.apple.system.logging</string>
			<key>PayloadUUID</key>
			<string>3433CF40-D00F-40A1-A44A-992D83305338</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
			<key>Subsystems</key>
			<dict>
				<key>com.apple.CoreHAP</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Enable-Oversize-Messages</key>
						<true/>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Info</string>
							<key>Persist</key>
							<string>Info</string>
						</dict>
						<key>Privacy-Enable-Level</key>
						<string>Private</string>
					</dict>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>PayloadIdentifier</key>
			<string>com.apple.HomeKitDeveloperLoggingProfile.HomeHub</string>
			<key>PayloadType</key>
			<string>com.apple.system.logging</string>
			<key>PayloadUUID</key>
			<string>36018731-D919-446C-A483-F32046D05F26</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
			<key>Subsystems</key>
			<dict>
				<key>com.apple.HomeHub</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Default-Privacy-Setting</key>
						<string>Public</string>
						<key>Enable-Oversize-Messages</key>
						<true/>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Info</string>
							<key>Persist</key>
							<string>Info</string>
						</dict>
					</dict>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>PayloadDisplayName</key>
			<string>Messages Extension Logging</string>
			<key>PayloadIdentifier</key>
			<string>LoggingPayload</string>
			<key>PayloadType</key>
			<string>com.apple.system.logging</string>
			<key>PayloadUUID</key>
			<string>2e3e9fe3-3230-4c89-9fa0-bfb934072739</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
			<key>Processes</key>
			<dict/>
			<key>Subsystems</key>
			<dict>
				<key>com.apple.AVConference</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Default-Privacy-Setting</key>
						<string>Public</string>
						<key>Enable-Oversize-Messages</key>
						<true/>
					</dict>
				</dict>
				<key>com.apple.IDS</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Default-Privacy-Setting</key>
						<string>Public</string>
					</dict>
					<key>IDSDelivery-oversized</key>
					<dict>
						<key>Enable-Oversize-Messages</key>
						<true/>
					</dict>
					<key>MessageDelivery-oversized</key>
					<dict>
						<key>Enable-Oversize-Messages</key>
						<true/>
					</dict>
				</dict>
				<key>com.apple.Messages</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Default-Privacy-Setting</key>
						<string>Public</string>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Info</string>
							<key>Persist</key>
							<string>Info</string>
						</dict>
					</dict>
					<key>MessageDelivery-oversized</key>
					<dict>
						<key>Enable-Oversize-Messages</key>
						<true/>
					</dict>
				</dict>
				<key>com.apple.MessagesEvents</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Default-Privacy-Setting</key>
						<string>Public</string>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Info</string>
							<key>Persist</key>
							<string>Info</string>
						</dict>
					</dict>
				</dict>
				<key>com.apple.Registration</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Default-Privacy-Setting</key>
						<string>Public</string>
					</dict>
					<key>FTMessageDelivery-oversized</key>
					<dict>
						<key>Enable-Oversize-Messages</key>
						<true/>
					</dict>
					<key>IDSService-oversized</key>
					<dict>
						<key>Enable-Oversize-Messages</key>
						<true/>
					</dict>
					<key>MessageDelivery-oversized</key>
					<dict>
						<key>Enable-Oversize-Messages</key>
						<true/>
					</dict>
					<key>Sysdiagnose-oversized</key>
					<dict>
						<key>Enable-Oversize-Messages</key>
						<true/>
					</dict>
				</dict>
				<key>com.apple.Transport</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Default-Privacy-Setting</key>
						<string>Public</string>
					</dict>
				</dict>
				<key>com.apple.apsd</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Default-Privacy-Setting</key>
						<string>Public</string>
					</dict>
					<key>courier-oversized</key>
					<dict>
						<key>Enable-Oversize-Messages</key>
						<true/>
					</dict>
				</dict>
				<key>com.apple.calls.calldirectory</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Default-Privacy-Setting</key>
						<string>Public</string>
						<key>Enable-Oversize-Messages</key>
						<true/>
					</dict>
				</dict>
				<key>com.apple.calls.callkit</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Default-Privacy-Setting</key>
						<string>Public</string>
						<key>Enable-Oversize-Messages</key>
						<true/>
					</dict>
				</dict>
				<key>com.apple.calls.callservicesd</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Default-Privacy-Setting</key>
						<string>Public</string>
						<key>Enable-Oversize-Messages</key>
						<true/>
					</dict>
				</dict>
				<key>com.apple.calls.facetime</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Default-Privacy-Setting</key>
						<string>Public</string>
						<key>Enable-Oversize-Messages</key>
						<true/>
					</dict>
				</dict>
				<key>com.apple.calls.identitylookup</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Default-Privacy-Setting</key>
						<string>Public</string>
						<key>Enable-Oversize-Messages</key>
						<true/>
					</dict>
				</dict>
				<key>com.apple.calls.incallservice</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Default-Privacy-Setting</key>
						<string>Public</string>
						<key>Enable-Oversize-Messages</key>
						<true/>
					</dict>
				</dict>
				<key>com.apple.calls.intenthandler</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Default-Privacy-Setting</key>
						<string>Public</string>
						<key>Enable-Oversize-Messages</key>
						<true/>
					</dict>
				</dict>
				<key>com.apple.calls.messagefilter</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Default-Privacy-Setting</key>
						<string>Public</string>
						<key>Enable-Oversize-Messages</key>
						<true/>
					</dict>
				</dict>
				<key>com.apple.calls.mobilephone</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Default-Privacy-Setting</key>
						<string>Public</string>
						<key>Enable-Oversize-Messages</key>
						<true/>
					</dict>
				</dict>
				<key>com.apple.calls.telephonyui</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Default-Privacy-Setting</key>
						<string>Public</string>
						<key>Enable-Oversize-Messages</key>
						<true/>
					</dict>
				</dict>
				<key>com.apple.calls.telephonyutilities</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Default-Privacy-Setting</key>
						<string>Public</string>
						<key>Enable-Oversize-Messages</key>
						<true/>
					</dict>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>PayloadIdentifier</key>
			<string>com.apple.SoundAnalysis.loggingprofile.1</string>
			<key>PayloadType</key>
			<string>com.apple.system.logging</string>
			<key>PayloadUUID</key>
			<string>CF726DB3-1DEC-4A67-8A2E-9BCA662CB64C</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
			<key>Subsystems</key>
			<dict>
				<key>com.apple.SoundAnalysis</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Default-Privacy-Setting</key>
						<string>Public</string>
					</dict>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>PayloadIdentifier</key>
			<string>com.apple.siri.loggingprofile.1</string>
			<key>PayloadType</key>
			<string>com.apple.system.logging</string>
			<key>PayloadUUID</key>
			<string>7E27CB42-C6E0-4302-AC18-F77C4C22BF96</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
			<key>Subsystems</key>
			<dict>
				<key>com.apple.siri</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Default-Privacy-Setting</key>
						<string>Public</string>
					</dict>
				</dict>
				<key>com.apple.siri.phone</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Default-Privacy-Setting</key>
						<string>Public</string>
					</dict>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>PayloadContent</key>
			<array>
				<dict>
					<key>DefaultsData</key>
					<dict>
						<key>EXPOSE_SYSDIAGNOSE_FOR_HOMEPOD</key>
						<true/>
					</dict>
					<key>DefaultsDomainName</key>
					<string>com.apple.Home</string>
				</dict>
			</array>
			<key>PayloadIdentifier</key>
			<string>com.apple.defaults.1</string>
			<key>PayloadType</key>
			<string>com.apple.defaults.managed</string>
			<key>PayloadUUID</key>
			<string>C41BC262-4B01-4952-8820-821309196AA6</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
		</dict>
	</array>
	<key>PayloadDescription</key>
	<string>Enables Check In Logging</string>
	<key>PayloadDisplayName</key>
	<string>Check In Logging</string>
	<key>PayloadIdentifier</key>
	<string>com.apple.checkin.loggingprofile</string>
	<key>PayloadOrganization</key>
	<string>Apple Inc.</string>
	<key>PayloadType</key>
	<string>Configuration</string>
	<key>PayloadUUID</key>
	<string>0EA3ED0D-D668-4621-8C94-18EA24EAB6F3</string>
	<key>PayloadVersion</key>
	<integer>1</integer>
	<key>RemovalDate</key>
	<date>2025-05-04T07:00:00Z</date>
</dict>
</plist>
