<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>ConsentText</key>
	<dict>
		<key>default</key>
		<string>The Digital Car Key logging profile generates files that allow Apple to troubleshoot issues with your device and help Apple to improve its products and services. The generated files may contain some of your personal information relating to your Digital Car Key usage while you have this profile installed, including information about any devices you pair with, your location while using your Digital Car Key, and actions you perform using your Digital Car Key, such as locking or sharing keys. The generated files may also contain personal information about persons with whom you've shared your Digital Car Key, including email addresses or phone numbers. The profile will expire after 30 days.
		You will be able to review the log files on your com puter prior to sending them to Apple. To turn off logging, open Settings, tap General, tap "Device Management", tap "Digital Car Key Loggong Profile for Enhanced Logging", and tap "Delete Profile".
		By enabling Digital Car Key Logging diagnostics and submitting the generated files to Apple, you agree and consent to Apple's and its subsidiaries' and agents' transmission, collection, maintenance, processing and use of this information as described above.
		At All times, information received by Apple will be treated in accordance with Apple's Privacy Policy, which can be found at www.apple.com/privacy (http://www.apple.com.privacy).
        
Apple Confidential Profile. Do not distribute. Not to be used or disclosed without permission from Apple. Copyright © 2024, Apple Inc. All rights reserved.</string>
	</dict>
	<key>DurationUntilRemoval</key>
	<real>2592000.0</real>
	<key>PayloadContent</key>
	<array>
		<dict>
			<key>PayloadIdentifier</key>
			<string>com.apple.wallet.logging.1</string>
			<key>PayloadType</key>
			<string>com.apple.system.logging</string>
			<key>PayloadUUID</key>
			<string>9F1F9695-DC16-4537-AF27-24493DC192E1</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
			<key>Subsystems</key>
			<dict>
				<key>com.apple.passkit</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Default-Privacy-Setting</key>
						<string>Public</string>
						<key>Enable-Oversize-Messages</key>
						<true/>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Debug</string>
							<key>Persist</key>
							<string>Debug</string>
						</dict>
						<key>Persist</key>
						<string>Debug</string>
					</dict>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>PayloadIdentifier</key>
			<string>com.apple.nfc.logging.1</string>
			<key>PayloadType</key>
			<string>com.apple.system.logging</string>
			<key>PayloadUUID</key>
			<string>26A476E-ED3A-4AF5-BCF3-C546BB495C46</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
			<key>Subsystems</key>
			<dict>
				<key>com.apple.nfc</key>
				<dict>
					<key>LogAPDU</key>
					<true/>
					<key>LogNCI</key>
					<true/>
					<key>LogRF</key>
					<integer>4</integer>
					<key>LogTSM</key>
					<true/>
					<key>LogTransactionDetails</key>
					<true/>
					<key>Logging</key>
					<dict>
						<key>Default-Privacy-Setting</key>
						<string>Public</string>
						<key>Enable</key>
						<string>Debug</string>
						<key>Enable-Oversize-Messages</key>
						<true/>
						<key>Persist</key>
						<string>Debug</string>
					</dict>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>PayloadIdentifier</key>
			<string>com.apple.coreidv.logging.1</string>
			<key>PayloadType</key>
			<string>com.apple.system.logging</string>
			<key>PayloadUUID</key>
			<string>27B49654-DEBD-4868-B6B6-14AAE617C0CD</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
			<key>Subsystems</key>
			<dict>
				<key>com.apple.CoreIDV</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Enable-Oversize-Messages</key>
						<true/>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Debug</string>
							<key>Persist</key>
							<string>Debug</string>
						</dict>
					</dict>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>PayloadIdentifier</key>
			<string>com.apple.kml.logging.1</string>
			<key>PayloadType</key>
			<string>com.apple.system.logging</string>
			<key>PayloadUUID</key>
			<string>0062F206-8FF6-4A08-B84C-69ABCC129700</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
			<key>Subsystems</key>
			<dict>
				<key>com.apple.sesd.kml</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Default-Privacy-Setting</key>
						<string>Public</string>
						<key>Enable-Oversize-Messages</key>
						<true/>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Debug</string>
							<key>Persist</key>
							<string>Debug</string>
						</dict>
						<key>Persist</key>
						<string>Debug</string>
						<key>TTL</key>
						<dict>
							<key>Default</key>
							<integer>7</integer>
						</dict>
					</dict>
				</dict>
				<key>com.apple.seserviced</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Default-Privacy-Setting</key>
						<string>Public</string>
						<key>Enable-Oversize-Messages</key>
						<true/>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Debug</string>
							<key>Persist</key>
							<string>Debug</string>
						</dict>
						<key>Persist</key>
						<string>Debug</string>
						<key>TTL</key>
						<dict>
							<key>Default</key>
							<integer>7</integer>
						</dict>
					</dict>
				</dict>
				<key>com.apple.seserviced.framework</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Default-Privacy-Setting</key>
						<string>Public</string>
						<key>Enable-Oversize-Messages</key>
						<true/>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Debug</string>
							<key>Persist</key>
							<string>Debug</string>
						</dict>
						<key>Persist</key>
						<string>Debug</string>
						<key>TTL</key>
						<dict>
							<key>Default</key>
							<integer>7</integer>
						</dict>
					</dict>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>PayloadIdentifier</key>
			<string>com.apple.bluetooth.logging</string>
			<key>PayloadType</key>
			<string>com.apple.system.logging</string>
			<key>PayloadUUID</key>
			<string>EB7244A8-E5AF-4633-B207-AFA2D04EB5A8</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
			<key>Subsystems</key>
			<dict>
				<key>com.apple.bluetooth</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Enable-Private-Data</key>
						<true/>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Debug</string>
							<key>Persist</key>
							<string>Debug</string>
						</dict>
					</dict>
				</dict>
			</dict>
			<key>System</key>
			<dict>
				<key>Enable-Logging</key>
				<true/>
			</dict>
		</dict>
		<dict>
			<key>PayloadContent</key>
			<array>
				<dict>
					<key>DefaultsData</key>
					<dict>
						<key>ExtraZoningLog</key>
						<dict>
							<key>EnableZoneLogging</key>
							<true/>
						</dict>
						<key>FWStreamLogging</key>
						<dict>
							<key>FWCoreDumpEnable</key>
							<true/>
							<key>FWStreamLoggingEnable</key>
							<true/>
						</dict>
						<key>HCI</key>
						<dict>
							<key>lmpRouting</key>
							<true/>
						</dict>
						<key>HCITraces</key>
						<dict>
							<key>StackDebugEnabled</key>
							<true/>
						</dict>
					</dict>
					<key>DefaultsDomainName</key>
					<string>com.apple.MobileBluetooth.debug</string>
				</dict>
			</array>
			<key>PayloadIdentifier</key>
			<string>com.apple.defaults.1</string>
			<key>PayloadType</key>
			<string>com.apple.defaults.managed</string>
			<key>PayloadUUID</key>
			<string>7E48B601-E2E9-497A-9883-3A34C647E0BA</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
		</dict>
		<dict>
			<key>PayloadDisplayName</key>
			<string>Proximity Debug Logging</string>
			<key>PayloadIdentifier</key>
			<string>com.apple.Proximity.debug.logging</string>
			<key>PayloadType</key>
			<string>com.apple.system.logging</string>
			<key>PayloadUUID</key>
			<string>80A96170-E5DA-48DF-8D7F-782EC30B259B</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
			<key>Subsystems</key>
			<dict>
				<key>com.apple.Proximity</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Default</string>
							<key>Persist</key>
							<string>Default</string>
						</dict>
						<key>Privacy-Enable-Level</key>
						<string>Private</string>
					</dict>
				</dict>
				<key>com.apple.librose</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Default</string>
							<key>Persist</key>
							<string>Default</string>
						</dict>
						<key>Privacy-Enable-Level</key>
						<string>Private</string>
					</dict>
				</dict>
				<key>com.apple.nearbyd</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Default</string>
							<key>Persist</key>
							<string>Default</string>
						</dict>
						<key>Privacy-Enable-Level</key>
						<string>Private</string>
					</dict>
					<key>roseEnableFirmwareLogs</key>
					<integer>1</integer>
					<key>roseSaveCrashLogs</key>
					<integer>1</integer>
				</dict>
				<key>com.apple.proximity</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Default</string>
							<key>Persist</key>
							<string>Default</string>
						</dict>
						<key>Privacy-Enable-Level</key>
						<string>Private</string>
					</dict>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>PayloadContent</key>
			<array>
				<dict>
					<key>DefaultsData</key>
					<dict>
						<key>roseEnableFirmwareLogs</key>
						<integer>1</integer>
						<key>roseSaveCrashLogs</key>
						<integer>1</integer>
					</dict>
					<key>DefaultsDomainName</key>
					<string>com.apple.nearbyd</string>
				</dict>
			</array>
			<key>PayloadIdentifier</key>
			<string>com.apple.defaults.2</string>
			<key>PayloadType</key>
			<string>com.apple.defaults.managed</string>
			<key>PayloadUUID</key>
			<string>19697DD4-A896-4B5C-905B-F0D5693F0A9D</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
		</dict>
		<dict>
			<key>PayloadContent</key>
			<array>
				<dict>
					<key>DefaultsData</key>
					<dict>
						<key>debug.install.logging.applet</key>
						<true/>
						<key>debug.logging.profile.to.install</key>
						<string>Development</string>
					</dict>
					<key>DefaultsDomainName</key>
					<string>com.apple.seserviced</string>
				</dict>
			</array>
			<key>PayloadIdentifier</key>
			<string>com.apple.defaults.3</string>
			<key>PayloadType</key>
			<string>com.apple.defaults.managed</string>
			<key>PayloadUUID</key>
			<string>264037B7-6684-44F3-A0F4-BDA7AABC3668</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
		</dict>
	</array>
	<key>PayloadDescription</key>
	<string>Enables All Logging for Digital Car Key Technologies</string>
	<key>PayloadDisplayName</key>
	<string>Digital Car Key Logging Profile for Enhanced Logging</string>
	<key>PayloadIdentifier</key>
	<string>com.apple.wallet.logging</string>
	<key>PayloadOrganization</key>
	<string>Apple Inc.</string>
	<key>PayloadRebootSuggested</key>
	<true/>
	<key>PayloadType</key>
	<string>Configuration</string>
	<key>PayloadUUID</key>
	<string>4A51D389-3F23-4FDA-A977-1A0C33DEA2E6</string>
	<key>PayloadVersion</key>
	<integer>1</integer>
	<key>RemovalDate</key>
	<date>2025-07-12T07:00:00Z</date>
</dict>
</plist>
