<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>ConsentText</key>
	<dict>
		<key>default</key>
		<string>Copyright © 2021, Apple Inc. All rights reserved. The Enable Maps Logging Profile generates files that allow Apple to troubleshoot issues with the loading of Maps on your iOS device or Apple Watch. The generated files include information, including location, regarding your interaction with Maps such as Maps-related search queries and results, data about Maps images loading, and information related to when you report an issue in Maps. If your iPhone is paired with an Apple Watch, the generated files will also include Apple Watch connectivity data. The profile will expire after 14 days.

You will be able to turn on and off logging at any time while the Profile is installed, and will be able to review the log files on your computer prior to sending them to Apple. To turn off logging on your iOS device, open Settings, tap General, tap "Profiles &amp; Device Management", tap "Enable Maps Logging" Profile and tap "Delete Profile." To turn off logging on your Apple Watch, open the "Apple Watch" app on your iPhone, tap "General," tap on "Profiles," tap the "Enable Maps Logging" Profile and tap "Delete Profile." By enabling this diagnostic tool and sending a copy of the generated files to Apple, you are consenting to Apple's use of the content of such files in accordance with its privacy policy (http://www.apple.com/legal/privacy).

Apple Confidential Profile. Do not distribute. Not to be used or disclosed without permission from Apple. Copyright © 2024, Apple Inc. All rights reserved.</string>
	</dict>
	<key>DurationUntilRemoval</key>
	<integer>1209600</integer>
	<key>PayloadContent</key>
	<array>
		<dict>
			<key>PayloadDisplayName</key>
			<string>Apple Maps Logging Profile</string>
			<key>PayloadIdentifier</key>
			<string>LoggingPayload</string>
			<key>PayloadType</key>
			<string>com.apple.system.logging</string>
			<key>PayloadUUID</key>
			<string>94E3105A-F5D9-4C57-BD35-0A9102D46026</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
			<key>Subsystems</key>
			<dict>
				<key>com.apple.GeoServices</key>
				<dict>
					<key>BackgroundState</key>
					<dict>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Debug</string>
						</dict>
					</dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Default-Privacy-Setting</key>
						<string>Public</string>
						<key>Enable-Private-Data</key>
						<true/>
					</dict>
					<key>DeviceConnection</key>
					<dict>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Debug</string>
						</dict>
					</dict>
					<key>MSPUpNext</key>
					<dict>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Debug</string>
						</dict>
					</dict>
					<key>MapsActivity</key>
					<dict>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Debug</string>
						</dict>
					</dict>
					<key>MapsAppDelegate</key>
					<dict>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Debug</string>
						</dict>
					</dict>
					<key>MapsDefault</key>
					<dict>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Debug</string>
						</dict>
					</dict>
					<key>MapsLaunch</key>
					<dict>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Debug</string>
						</dict>
					</dict>
					<key>MapsSupport</key>
					<dict>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Debug</string>
						</dict>
					</dict>
					<key>MapsSupportJournal</key>
					<dict>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Debug</string>
						</dict>
					</dict>
					<key>ResourceManifest</key>
					<dict>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Debug</string>
						</dict>
					</dict>
					<key>TransitWidget</key>
					<dict>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Debug</string>
						</dict>
					</dict>
				</dict>
				<key>com.apple.Maps.RequestResponse</key>
				<dict>
					<key>AddressCorrection</key>
					<dict>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Debug</string>
						</dict>
					</dict>
					<key>Autocomplete</key>
					<dict>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Debug</string>
						</dict>
					</dict>
					<key>BatchReverseGeocode</key>
					<dict>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Debug</string>
						</dict>
					</dict>
					<key>BusinessPortalBaseURL</key>
					<dict>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Debug</string>
						</dict>
					</dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Default-Privacy-Setting</key>
						<string>Public</string>
						<key>Enable-Oversize-Messages</key>
						<true/>
						<key>Enable-Private-Data</key>
						<true/>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Debug</string>
							<key>Persist</key>
							<string>Debug</string>
						</dict>
						<key>TTL</key>
						<dict>
							<key>Debug</key>
							<integer>5</integer>
						</dict>
					</dict>
					<key>Directions</key>
					<dict>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Debug</string>
						</dict>
					</dict>
					<key>ETA</key>
					<dict>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Debug</string>
						</dict>
					</dict>
					<key>ExperimentRequest</key>
					<dict>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Debug</string>
						</dict>
					</dict>
					<key>GEORequest</key>
					<dict>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Debug</string>
							<key>Persist</key>
							<string>Debug</string>
						</dict>
					</dict>
					<key>LocationShift</key>
					<dict>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Debug</string>
						</dict>
					</dict>
					<key>LogMessageUsageURL</key>
					<dict>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Debug</string>
						</dict>
					</dict>
					<key>PlaceDataLookup</key>
					<dict>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Debug</string>
						</dict>
					</dict>
					<key>ProblemOptIn</key>
					<dict>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Debug</string>
						</dict>
					</dict>
					<key>ProblemStatus</key>
					<dict>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Debug</string>
						</dict>
					</dict>
					<key>ProblemSubmission</key>
					<dict>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Debug</string>
						</dict>
					</dict>
					<key>SimpleETA</key>
					<dict>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Debug</string>
						</dict>
					</dict>
					<key>SpatialLookup</key>
					<dict>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Debug</string>
						</dict>
					</dict>
				</dict>
			</dict>
		</dict>
	</array>
	<key>PayloadDescription</key>
	<string>This profile enables additional logging for Apple Maps.</string>
	<key>PayloadDisplayName</key>
	<string>Enable Maps Logging Profile</string>
	<key>PayloadIdentifier</key>
	<string>com.apple.mapslogging</string>
	<key>PayloadOrganization</key>
	<string>Apple Inc.</string>
	<key>PayloadRebootSuggested</key>
	<false/>
	<key>PayloadType</key>
	<string>Configuration</string>
	<key>PayloadUUID</key>
	<string>6F149AE6-05B1-4E5B-A94E-DDD000693EB2</string>
	<key>PayloadVersion</key>
	<integer>1</integer>
	<key>RemovalDate</key>
	<date>2025-06-23T07:00:00Z</date>
</dict>
</plist>
