<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>ConsentText</key>
	<dict>
		<key>default</key>
		<string>The FaceTime and Call Activity Logging Profile generates files that allow Apple to troubleshoot issues with your device and help Apple to improve its products and services. The generated files may contain some of your personal information, including device identifiers; contact names; phone numbers used in FaceTime and Messages, third-party CallKit apps, third-party CallKit extensions using Messages, and calls made with Siri; Apple IDs of the accounts on the device; and logs of incoming and outgoing calls and audio routes.  If you install this profile, it will automatically turn the logging on, and this data will be captured when you take a Sysdiagnose on this device. The data will not leave the device unless you initiate a Sysdiagnose and send the results. The profile will expire after 4 days. 

You will be able to turn on and off logging at any time while the Profile is installed. To turn off logging on your iOS device, open Settings, tap General, tap "Profiles," tap "FaceTime and Call Activity Logging Profile," and tap "Delete Profile."

By enabling this diagnostic tool and sending a copy of the generated files to Apple, you are consenting to Apple's use of the content of such files in accordance with its privacy policy (http://www.apple.com/legal/privacy). You will be able to review the log files on your computer prior to sending them to Apple.

Apple Confidential Profile. Do not distribute. Not to be used or disclosed without permission from Apple. Copyright © 2023, Apple Inc. All rights reserved.</string>
	</dict>
	<key>PayloadContent</key>
	<array>
		<dict>
			<key>PayloadDisplayName</key>
			<string>Messages Extension Logging</string>
			<key>PayloadIdentifier</key>
			<string>com.apple.system.logging.2e3e9fe3-3230-4c89-9fa0-bfb934072739</string>
			<key>PayloadType</key>
			<string>com.apple.system.logging</string>
			<key>PayloadUUID</key>
			<string>2e3e9fe3-3230-4c89-9fa0-bfb934072739</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
			<key>Processes</key>
			<dict/>
			<key>Subsystems</key>
			<dict>
				<key>com.apple.AVConference</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Default-Privacy-Setting</key>
						<string>Public</string>
						<key>Enable-Oversize-Messages</key>
						<true/>
					</dict>
				</dict>
				<key>com.apple.IDS</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Default-Privacy-Setting</key>
						<string>Public</string>
					</dict>
					<key>IDSDelivery-oversized</key>
					<dict>
						<key>Enable-Oversize-Messages</key>
						<true/>
					</dict>
					<key>MessageDelivery-oversized</key>
					<dict>
						<key>Enable-Oversize-Messages</key>
						<true/>
					</dict>
				</dict>
				<key>com.apple.Messages</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Default-Privacy-Setting</key>
						<string>Public</string>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Info</string>
							<key>Persist</key>
							<string>Info</string>
						</dict>
					</dict>
					<key>MessageDelivery-oversized</key>
					<dict>
						<key>Enable-Oversize-Messages</key>
						<true/>
					</dict>
				</dict>
				<key>com.apple.MessagesEvents</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Default-Privacy-Setting</key>
						<string>Public</string>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Info</string>
							<key>Persist</key>
							<string>Info</string>
						</dict>
					</dict>
				</dict>
				<key>com.apple.Registration</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Default-Privacy-Setting</key>
						<string>Public</string>
					</dict>
					<key>FTMessageDelivery-oversized</key>
					<dict>
						<key>Enable-Oversize-Messages</key>
						<true/>
					</dict>
					<key>IDSService-oversized</key>
					<dict>
						<key>Enable-Oversize-Messages</key>
						<true/>
					</dict>
					<key>MessageDelivery-oversized</key>
					<dict>
						<key>Enable-Oversize-Messages</key>
						<true/>
					</dict>
					<key>Sysdiagnose-oversized</key>
					<dict>
						<key>Enable-Oversize-Messages</key>
						<true/>
					</dict>
				</dict>
				<key>com.apple.Transparency</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Default-Privacy-Setting</key>
						<string>Public</string>
					</dict>
				</dict>
				<key>com.apple.Transport</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Default-Privacy-Setting</key>
						<string>Public</string>
					</dict>
				</dict>
				<key>com.apple.apsd</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Default-Privacy-Setting</key>
						<string>Public</string>
					</dict>
					<key>courier-oversized</key>
					<dict>
						<key>Enable-Oversize-Messages</key>
						<true/>
					</dict>
				</dict>
				<key>com.apple.calls.calldirectory</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Default-Privacy-Setting</key>
						<string>Public</string>
						<key>Enable-Oversize-Messages</key>
						<true/>
					</dict>
				</dict>
				<key>com.apple.calls.callkit</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Default-Privacy-Setting</key>
						<string>Public</string>
						<key>Enable-Oversize-Messages</key>
						<true/>
					</dict>
				</dict>
				<key>com.apple.calls.callservicesd</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Default-Privacy-Setting</key>
						<string>Public</string>
						<key>Enable-Oversize-Messages</key>
						<true/>
					</dict>
				</dict>
				<key>com.apple.calls.facetime</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Default-Privacy-Setting</key>
						<string>Public</string>
						<key>Enable-Oversize-Messages</key>
						<true/>
					</dict>
				</dict>
				<key>com.apple.calls.identitylookup</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Default-Privacy-Setting</key>
						<string>Public</string>
						<key>Enable-Oversize-Messages</key>
						<true/>
					</dict>
				</dict>
				<key>com.apple.calls.incallservice</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Default-Privacy-Setting</key>
						<string>Public</string>
						<key>Enable-Oversize-Messages</key>
						<true/>
					</dict>
				</dict>
				<key>com.apple.calls.intenthandler</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Default-Privacy-Setting</key>
						<string>Public</string>
						<key>Enable-Oversize-Messages</key>
						<true/>
					</dict>
				</dict>
				<key>com.apple.calls.messagefilter</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Default-Privacy-Setting</key>
						<string>Public</string>
						<key>Enable-Oversize-Messages</key>
						<true/>
					</dict>
				</dict>
				<key>com.apple.calls.mobilephone</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Default-Privacy-Setting</key>
						<string>Public</string>
						<key>Enable-Oversize-Messages</key>
						<true/>
					</dict>
				</dict>
				<key>com.apple.calls.telephonyui</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Default-Privacy-Setting</key>
						<string>Public</string>
						<key>Enable-Oversize-Messages</key>
						<true/>
					</dict>
				</dict>
				<key>com.apple.calls.telephonyutilities</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Default-Privacy-Setting</key>
						<string>Public</string>
						<key>Enable-Oversize-Messages</key>
						<true/>
					</dict>
				</dict>
			</dict>
		</dict>
	</array>
	<key>PayloadDescription</key>
	<string>Enables FaceTime and Call Activity Logging</string>
	<key>PayloadDisplayName</key>
	<string>FaceTime and Call Activity Logging</string>
	<key>PayloadIdentifier</key>
	<string>LoggingProfile</string>
	<key>PayloadOrganization</key>
	<string>Apple Inc.</string>
	<key>PayloadRemovalDisallowed</key>
	<false/>
	<key>PayloadType</key>
	<string>Configuration</string>
	<key>PayloadUUID</key>
	<string>9C817421-D357-4A19-9924-E9AC569B9816</string>
	<key>PayloadVersion</key>
	<integer>1</integer>
	<key>RemovalDate</key>
	<date>2024-11-26T08:00:00Z</date>
</dict>
</plist>
