<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>ConsentText</key>
	<dict>
		<key>default</key>
		<string>The Home Developer Logging Profile ("Profile") generates files on your iOS device and allows you to collect diagnostic data from your HomeKit enabled products ("HomeKit accessories") through the Home app. The generated files ("iOS logs") may include your Apple ID and the IP address of HomeKit accessories associated with your iOS device. The diagnostic data ("accessory logs") may include your HomeKit accessories' serial number, name, IP address, and MAC address; data on your HomeKit accessories' configuration and usage; and data on nearby devices and networks.

            This profile will expire after 7 days. You can stop the Profile from generating iOS logs by going to Settings &gt; General &gt; Profiles &gt; Home Logging &gt; Delete Profile.  By following our instructions for enabling the Profile and sending copies of the iOS logs and/or accessory logs to Apple, you consent to Apple using such logs to improve and troubleshoot issues with HomeKit accessories and services in accordance with its privacy policy (http://www.apple.com/legal/privacy). You also consent to Apple sharing such logs with HomeKit developers to the extent necessary for troubleshooting issues with your HomeKit accessories.  

Apple Confidential Profile. Do not distribute. Not to be used or disclosed without permission from Apple. Copyright � 2023, Apple Inc. All rights reserved.

Apple Confidential Profile. Do not distribute. Not to be used or disclosed without permission from Apple. Copyright © 2023, Apple Inc. All rights reserved.</string>
	</dict>
	<key>DurationUntilRemoval</key>
	<integer>604800</integer>
	<key>PayloadContent</key>
	<array>
		<dict>
			<key>PayloadIdentifier</key>
			<string>com.apple.HomeKitDeveloperLoggingProfile.HomeKit</string>
			<key>PayloadType</key>
			<string>com.apple.system.logging</string>
			<key>PayloadUUID</key>
			<string>5B1C7DEF-E7CA-4DEA-BDBF-A2E75041935C</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
			<key>Subsystems</key>
			<dict>
				<key>com.apple.HomeKit</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Enable-Oversize-Messages</key>
						<true/>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Info</string>
							<key>Persist</key>
							<string>Info</string>
						</dict>
						<key>Privacy-Enable-Level</key>
						<string>Private</string>
					</dict>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>PayloadIdentifier</key>
			<string>com.apple.HomeKitDeveloperLoggingProfile.HomeFramework</string>
			<key>PayloadType</key>
			<string>com.apple.system.logging</string>
			<key>PayloadUUID</key>
			<string>1822D95A-F159-4AD3-B5B7-FABC9ED5B3E6</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
			<key>Subsystems</key>
			<dict>
				<key>com.apple.Home.framework</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Enable-Oversize-Messages</key>
						<true/>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Info</string>
							<key>Persist</key>
							<string>Info</string>
						</dict>
						<key>Privacy-Enable-Level</key>
						<string>Private</string>
					</dict>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>PayloadIdentifier</key>
			<string>com.apple.HomeKitDeveloperLoggingProfile.HomeApp</string>
			<key>PayloadType</key>
			<string>com.apple.system.logging</string>
			<key>PayloadUUID</key>
			<string>24C99065-1168-4FAC-853D-EE74DB3CDD30</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
			<key>Subsystems</key>
			<dict>
				<key>com.apple.Home</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Enable-Oversize-Messages</key>
						<true/>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Info</string>
							<key>Persist</key>
							<string>Info</string>
						</dict>
						<key>Privacy-Enable-Level</key>
						<string>Private</string>
					</dict>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>PayloadIdentifier</key>
			<string>com.apple.HomeKitDeveloperLoggingProfile.CoreHAP</string>
			<key>PayloadType</key>
			<string>com.apple.system.logging</string>
			<key>PayloadUUID</key>
			<string>3433CF40-D00F-40A1-A44A-992D83305338</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
			<key>Subsystems</key>
			<dict>
				<key>com.apple.CoreHAP</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Enable-Oversize-Messages</key>
						<true/>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Info</string>
							<key>Persist</key>
							<string>Info</string>
						</dict>
						<key>Privacy-Enable-Level</key>
						<string>Private</string>
					</dict>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>PayloadIdentifier</key>
			<string>com.apple.HomeKitDeveloperLoggingProfile.HomeKitEvents</string>
			<key>PayloadType</key>
			<string>com.apple.system.logging</string>
			<key>PayloadUUID</key>
			<string>05A25AF0-5A64-489A-BF94-7BB8DA517BF8</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
			<key>Subsystems</key>
			<dict>
				<key>com.apple.HomeKitEvents</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Enable-Oversize-Messages</key>
						<true/>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Info</string>
							<key>Persist</key>
							<string>Info</string>
						</dict>
						<key>Privacy-Enable-Level</key>
						<string>Private</string>
					</dict>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>PayloadIdentifier</key>
			<string>com.apple.HomeKitDeveloperLoggingProfile.HomeKitEventRouter</string>
			<key>PayloadType</key>
			<string>com.apple.system.logging</string>
			<key>PayloadUUID</key>
			<string>C73A0D9E-55A5-4620-9FFB-317FA3E3C812</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
			<key>Subsystems</key>
			<dict>
				<key>com.apple.HomeKitEventRouter</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Enable-Oversize-Messages</key>
						<true/>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Info</string>
							<key>Persist</key>
							<string>Info</string>
						</dict>
						<key>Privacy-Enable-Level</key>
						<string>Private</string>
					</dict>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>PayloadContent</key>
			<array>
				<dict>
					<key>DefaultsData</key>
					<dict>
						<key>EXPOSE_ACCESSORY_DIAGONSTICS</key>
						<true/>
					</dict>
					<key>DefaultsDomainName</key>
					<string>com.apple.Home</string>
				</dict>
			</array>
			<key>PayloadIdentifier</key>
			<string>com.apple.defaults.1</string>
			<key>PayloadType</key>
			<string>com.apple.defaults.managed</string>
			<key>PayloadUUID</key>
			<string>DD8412B1-E6BD-4F5B-9B80-75181DB6289C</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
		</dict>
		<dict>
			<key>PayloadContent</key>
			<array>
				<dict>
					<key>DefaultsData</key>
					<dict>
						<key>EXPOSE_SYSDIAGNOSE_FOR_HOMEPOD</key>
						<true/>
					</dict>
					<key>DefaultsDomainName</key>
					<string>com.apple.Home</string>
				</dict>
			</array>
			<key>PayloadIdentifier</key>
			<string>com.apple.defaults.2</string>
			<key>PayloadType</key>
			<string>com.apple.defaults.managed</string>
			<key>PayloadUUID</key>
			<string>01382723-4A8F-4547-A718-DE7E9FA8FEF5</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
		</dict>
	</array>
	<key>PayloadDescription</key>
	<string>Enables Home Developer Logging</string>
	<key>PayloadDisplayName</key>
	<string>Home Logging</string>
	<key>PayloadIdentifier</key>
	<string>com.apple.HomeKitDeveloperLoggingProfile</string>
	<key>PayloadOrganization</key>
	<string>Apple Inc.</string>
	<key>PayloadRemovalDisallowed</key>
	<false/>
	<key>PayloadType</key>
	<string>Configuration</string>
	<key>PayloadUUID</key>
	<string>0A06DC8D-C044-469E-B328-EABA8B783703</string>
	<key>PayloadVersion</key>
	<integer>1</integer>
	<key>RemovalDate</key>
	<date>2024-11-11T08:00:00Z</date>
</dict>
</plist>
