<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>ConsentText</key>
	<dict>
		<key>default</key>
		<string>The iPod Access Protocol (iAP) iOS Diagnostics Profile generates files that allow Apple to troubleshoot issues with your device and help Apple to improve its products and services. The generated files may contain some of your personal information, including the accessory identifiers and type of accessories, the applications used with each accessory, when an accessory and/or its application was used, metadata from your music library, caller information for FaceTime and/or regular calls when connected to an accessory, and entries in the Recents/Favorites list. If you install this profile, it will automatically turn the logging on, and this data will be captured when you take a Sysdiagnose on this device. The data will not leave the device unless you initiate a Sysdiagnose and send the results. The profile will expire after 1 day.

You will be able to turn on and off logging at any time while the Profile is installed. To turn off logging on your iOS device, open Settings, tap General, tap "Profiles," tap iPod Access Protocol iOS Diagnostics Profile," and tap "Delete Profile."

By enabling this diagnostic tool and sending a copy of the generated files to Apple, you are consenting to Apple's use of the content of such files in accordance with its privacy policy (http://www.apple.com/legal/privacy).

Apple Confidential Profile. Do not distribute. Not to be used or disclosed without permission from Apple. Copyright © 2024, Apple Inc. All rights reserved.</string>
	</dict>
	<key>DurationUntilRemoval</key>
	<real>86400.0</real>
	<key>PayloadContent</key>
	<array>
		<dict>
			<key>PayloadContent</key>
			<array>
				<dict>
					<key>DefaultsData</key>
					<dict>
						<key>IAPLogging</key>
						<true/>
					</dict>
					<key>DefaultsDomainName</key>
					<string>com.apple.Preferences</string>
				</dict>
				<dict>
					<key>DefaultsData</key>
					<dict>
						<key>LogEAEvents</key>
						<true/>
					</dict>
					<key>DefaultsDomainName</key>
					<string>com.apple.logging</string>
				</dict>
				<dict>
					<key>DefaultsData</key>
					<dict>
						<key>LogAttachEvents</key>
						<true/>
						<key>PrintIapPackets</key>
						<true/>
					</dict>
					<key>DefaultsDomainName</key>
					<string>com.apple.iapd</string>
				</dict>
				<dict>
					<key>DefaultsData</key>
					<dict>
						<key>AppleIDBusEventLogging</key>
						<true/>
					</dict>
					<key>DefaultsDomainName</key>
					<string>com.apple.iaptransportd</string>
				</dict>
			</array>
			<key>PayloadIdentifier</key>
			<string>com.apple.defaults.1</string>
			<key>PayloadType</key>
			<string>com.apple.defaults.managed</string>
			<key>PayloadUUID</key>
			<string>86E9A0CC-2C41-4996-B846-5913DBE271EA</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
		</dict>
	</array>
	<key>PayloadDescription</key>
	<string>Sets defaults</string>
	<key>PayloadDisplayName</key>
	<string>iAP iOS Diagnostics</string>
	<key>PayloadIdentifier</key>
	<string>com.apple.iaploggingprofile&gt;</string>
	<key>PayloadOrganization</key>
	<string>Apple Inc.</string>
	<key>PayloadType</key>
	<string>Configuration</string>
	<key>PayloadUUID</key>
	<string>48C0A989-C312-4A1D-B42A-6D7E4DAE1713</string>
	<key>PayloadVersion</key>
	<integer>1</integer>
	<key>RemovalDate</key>
	<date>2025-07-25T07:00:00Z</date>
</dict>
</plist>
