<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>ConsentText</key>
	<dict>
		<key>default</key>
		<string>The iTunes and App Stores Diagnostic Logging Profile generates files that allow Apple to troubleshoot issues with your device and help Apple to improve iTunes Store,App Store, and related products and services. The generated files may contain some of your personal information, including pages you visit, items you purchase, and your Apple ID and device identifiers. The profile will expire after 3 days.

You will be able to turn on and off logging at any time while the Profile is installed, and will be able to review the log files on your computer prior to sending them to Apple.  To turn off logging, open Settings, tap "General", tap "Profiles", tap "iTunes and App Stores Diagnostic Logging Profile" and tap "Delete Profile."

By enabling this diagnostic tool and sending a copy of the generated files to Apple, you are consenting to Apple's use of your information in accordance with its privacy policy (http://www.apple.com/legal/privacy).

Apple Confidential Profile. Do not distribute. Not to be used or disclosed without permission from Apple. Copyright © 2024, Apple Inc. All rights reserved.</string>
	</dict>
	<key>DurationUntilRemoval</key>
	<real>259200.0</real>
	<key>PayloadContent</key>
	<array>
		<dict>
			<key>PayloadIdentifier</key>
			<string>LoggingPayload</string>
			<key>PayloadType</key>
			<string>com.apple.system.logging</string>
			<key>PayloadUUID</key>
			<string>9312D372-0040-416B-8DA3-639508FE6F99</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
			<key>Processes</key>
			<dict>
				<key>com.apple.AppStore</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Default-Privacy-Setting</key>
						<string>Public</string>
					</dict>
					<key>Level</key>
					<dict>
						<key>Enable</key>
						<string>Info</string>
						<key>Persist</key>
						<string>Info</string>
					</dict>
				</dict>
				<key>com.apple.appstored</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Default-Privacy-Setting</key>
						<string>Public</string>
					</dict>
					<key>Level</key>
					<dict>
						<key>Enable</key>
						<string>Info</string>
						<key>Persist</key>
						<string>Info</string>
					</dict>
				</dict>
				<key>com.apple.installcoordinationd</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Default-Privacy-Setting</key>
						<string>Public</string>
					</dict>
					<key>Level</key>
					<dict>
						<key>Enable</key>
						<string>Info</string>
						<key>Persist</key>
						<string>Info</string>
					</dict>
				</dict>
				<key>com.apple.itunesstored</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Default-Privacy-Setting</key>
						<string>Public</string>
					</dict>
					<key>Level</key>
					<dict>
						<key>Enable</key>
						<string>Info</string>
						<key>Persist</key>
						<string>Info</string>
					</dict>
				</dict>
			</dict>
			<key>Subsystems</key>
			<dict>
				<key>com.apple.AppleMediaServices</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Default-Privacy-Setting</key>
						<string>Public</string>
					</dict>
					<key>Level</key>
					<dict>
						<key>Enable</key>
						<string>Debug</string>
						<key>Persist</key>
						<string>Info</string>
					</dict>
				</dict>
				<key>com.apple.StoreServices</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Default-Privacy-Setting</key>
						<string>Public</string>
					</dict>
					<key>Level</key>
					<dict>
						<key>Enable</key>
						<string>Info</string>
						<key>Persist</key>
						<string>Info</string>
					</dict>
				</dict>
				<key>com.apple.StoreServices.accounts</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Default-Privacy-Setting</key>
						<string>Public</string>
					</dict>
					<key>Level</key>
					<dict>
						<key>Enable</key>
						<string>Info</string>
						<key>Persist</key>
						<string>Info</string>
					</dict>
				</dict>
				<key>com.apple.StoreServices.bag</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Default-Privacy-Setting</key>
						<string>Public</string>
					</dict>
					<key>Level</key>
					<dict>
						<key>Enable</key>
						<string>Info</string>
						<key>Persist</key>
						<string>Info</string>
					</dict>
				</dict>
				<key>com.apple.appinstallation</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Default-Privacy-Setting</key>
						<string>Public</string>
					</dict>
					<key>Level</key>
					<dict>
						<key>Enable</key>
						<string>Info</string>
						<key>Persist</key>
						<string>Info</string>
					</dict>
				</dict>
				<key>com.apple.appstored</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Default-Privacy-Setting</key>
						<string>Public</string>
					</dict>
					<key>Level</key>
					<dict>
						<key>Enable</key>
						<string>Info</string>
						<key>Persist</key>
						<string>Info</string>
					</dict>
				</dict>
				<key>com.apple.installcoordination</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Default-Privacy-Setting</key>
						<string>Public</string>
					</dict>
					<key>Level</key>
					<dict>
						<key>Enable</key>
						<string>Info</string>
						<key>Persist</key>
						<string>Info</string>
					</dict>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>PayloadContent</key>
			<array>
				<dict>
					<key>DefaultsData</key>
					<dict>
						<key>DebugFileLevel</key>
						<integer>2</integer>
						<key>DebugLevel</key>
						<integer>2</integer>
						<key>LogIncomingHeaders</key>
						<true/>
						<key>LogOutgoingHeaders</key>
						<true/>
					</dict>
					<key>DefaultsDomainName</key>
					<string>com.apple.itunesstored</string>
				</dict>
				<dict>
					<key>DefaultsData</key>
					<dict>
						<key>DebugFileLevel</key>
						<integer>2</integer>
						<key>DebugLevel</key>
						<integer>2</integer>
						<key>LogIncomingHeaders</key>
						<true/>
						<key>LogOutgoingHeaders</key>
						<true/>
					</dict>
					<key>DefaultsDomainName</key>
					<string>com.apple.appstored</string>
				</dict>
			</array>
			<key>PayloadDescription</key>
			<string>Enables iTunes and App Stores diagnostic logging.</string>
			<key>PayloadDisplayName</key>
			<string>iTunes and App Stores Diagnostic Logging Profile</string>
			<key>PayloadIdentifier</key>
			<string>com.apple.defaults.managed.713B3C75-8B71-41CA-A020-C0FE429A743F</string>
			<key>PayloadOrganization</key>
			<string>Apple Inc</string>
			<key>PayloadType</key>
			<string>com.apple.defaults.managed</string>
			<key>PayloadUUID</key>
			<string>713B3C75-8B71-41CA-A020-C0FE429A743F</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
		</dict>
	</array>
	<key>PayloadDescription</key>
	<string>Enables iTunes and App Stores diagnostic logging.</string>
	<key>PayloadDisplayName</key>
	<string>iTunes and App Stores Diagnostic Logging Profile</string>
	<key>PayloadIdentifier</key>
	<string>com.apple.itms-debugging</string>
	<key>PayloadOrganization</key>
	<string>Apple Inc.</string>
	<key>PayloadType</key>
	<string>Configuration</string>
	<key>PayloadUUID</key>
	<string>991A12A9-E532-4552-B4E2-808C0DF8634F</string>
	<key>PayloadVersion</key>
	<integer>1</integer>
	<key>RemovalDate</key>
	<date>2025-08-31T07:00:00Z</date>
</dict>
</plist>
