<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>ConsentText</key>
	<dict>
		<key>default</key>
		<string>The iWork Diagnostics Profile generates files that allow Apple to troubleshoot issues with your device and help Apple to improve its related products and services. The generated files may contain some of your personal information, including full path names of your stored documents, the contents of iWork documents possibly including deleted content, full path names of your files accessed and Spotlight search results, your iCloud username, computer name, and the names of other computers registered with your iCloud account.

On iOS devices, you will be able to turn logging off at any time by tapping “Settings," tapping “General,” then “Profiles &amp; Device Management,” then “iWork Diagnostics Profile,” and finally “Remove Profile.” On MacOS, you will be able to turn logging off at any time by opening “System Preferences," then “Profiles,” then selecting “iWork Diagnostics Profile,” and finally click on the minus in the lower left corner to remove the selected profile and click the “Remove” button in the window that appears.  You will also be able to review the log files on your computer prior to sending them to Apple. This profile will expire after 14 days.

By enabling this diagnostic tool and sending a copy of the generated files to Apple, you are consenting to Apple’s use of the content of such files in accordance with its privacy policy (http://www.apple.com/legal/privacy).

Apple Confidential Profile. Do not distribute. Not to be used or disclosed without permission from Apple. Copyright © 2024, Apple Inc. All rights reserved.</string>
	</dict>
	<key>DurationUntilRemoval</key>
	<real>1209600.0</real>
	<key>PayloadContent</key>
	<array>
		<dict>
			<key>PayloadContent</key>
			<array>
				<dict>
					<key>DefaultsData</key>
					<dict>
						<key>TSUASLLogAllCategories</key>
						<integer>1</integer>
					</dict>
					<key>DefaultsDomainName</key>
					<string>.GlobalPreferences</string>
				</dict>
				<dict>
					<key>DefaultsData</key>
					<dict>
						<key>TSUCollaborationLogToFile</key>
						<string>YES</string>
					</dict>
					<key>DefaultsDomainName</key>
					<string>.GlobalPreferences</string>
				</dict>
				<dict>
					<key>DefaultsData</key>
					<dict>
						<key>TSUCollaborationLogFilterLevel</key>
						<integer>7</integer>
					</dict>
					<key>DefaultsDomainName</key>
					<string>.GlobalPreferences</string>
				</dict>
				<dict>
					<key>DefaultsData</key>
					<dict>
						<key>log.level</key>
						<integer>7</integer>
					</dict>
					<key>DefaultsDomainName</key>
					<string>com.apple.bird</string>
				</dict>
				<dict>
					<key>DefaultsData</key>
					<dict>
						<key>com.apple.clouddocs.log.level</key>
						<integer>7</integer>
					</dict>
					<key>DefaultsDomainName</key>
					<string>.GlobalPreferences</string>
				</dict>
				<dict>
					<key>DefaultsData</key>
					<dict>
						<key>DebugLevel</key>
						<integer>4</integer>
					</dict>
					<key>DefaultsDomainName</key>
					<string>com.apple.mmcs</string>
				</dict>
				<dict>
					<key>DefaultsData</key>
					<dict>
						<key>CKLogLevel</key>
						<integer>8</integer>
					</dict>
					<key>DefaultsDomainName</key>
					<string>.GlobalPreferences</string>
				</dict>
				<dict>
					<key>DefaultsData</key>
					<dict>
						<key>logLevel</key>
						<integer>7</integer>
					</dict>
					<key>DefaultsDomainName</key>
					<string>com.apple.accountsd</string>
				</dict>
				<dict>
					<key>DefaultsData</key>
					<dict>
						<key>com.apple.AOSKit.LogLevel</key>
						<integer>7</integer>
					</dict>
					<key>DefaultsDomainName</key>
					<string>.GlobalPreferences</string>
				</dict>
				<dict>
					<key>DefaultsData</key>
					<dict>
						<key>com.apple.coredata.ubiquity.logLevel</key>
						<integer>3</integer>
					</dict>
					<key>DefaultsDomainName</key>
					<string>.GlobalPreferences</string>
				</dict>
				<dict>
					<key>DefaultsData</key>
					<dict>
						<key>CSLogDetailedActivity</key>
						<string>YES</string>
					</dict>
					<key>DefaultsDomainName</key>
					<string>.GlobalPreferences</string>
				</dict>
				<dict>
					<key>DefaultsData</key>
					<dict>
						<key>CSLogToConsole</key>
						<string>YES</string>
					</dict>
					<key>DefaultsDomainName</key>
					<string>.GlobalPreferences</string>
				</dict>
				<dict>
					<key>DefaultsData</key>
					<dict>
						<key>DRLogLevel</key>
						<integer>8</integer>
					</dict>
					<key>DefaultsDomainName</key>
					<string>.GlobalPreferences</string>
				</dict>
			</array>
			<key>PayloadIdentifier</key>
			<string>com.apple.defaults.1</string>
			<key>PayloadType</key>
			<string>com.apple.defaults.managed</string>
			<key>PayloadUUID</key>
			<string>823122EB-DA83-4F6F-9B75-55EC3EBE5CE2</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
		</dict>
		<dict>
			<key>PayloadContent</key>
			<dict>
				<key>.GlobalPreferences</key>
				<dict>
					<key>Forced</key>
					<array>
						<dict>
							<key>mcx_preference_settings</key>
							<dict>
								<key>TSUASLLogAllCategories</key>
								<integer>1</integer>
							</dict>
						</dict>
					</array>
				</dict>
			</dict>
			<key>PayloadDisplayName</key>
			<string>Custom: (TSUASLLogAllCategories)</string>
			<key>PayloadEnabled</key>
			<true/>
			<key>PayloadIdentifier</key>
			<string>com.apple.mdm.30733CFF-A8C4-4855-90CF-E696C511E267.alacarte.customsettings.E6E35D25-A565-47ED-A4D9-4AD17D826084</string>
			<key>PayloadType</key>
			<string>com.apple.ManagedClient.preferences</string>
			<key>PayloadUUID</key>
			<string>E6E35D25-A565-47ED-A4D9-4AD17D826084</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
		</dict>
		<dict>
			<key>PayloadContent</key>
			<dict>
				<key>.GlobalPreferences</key>
				<dict>
					<key>Forced</key>
					<array>
						<dict>
							<key>mcx_preference_settings</key>
							<dict>
								<key>TSUCollaborationLogFilterLevel</key>
								<integer>7</integer>
							</dict>
						</dict>
					</array>
				</dict>
			</dict>
			<key>PayloadDisplayName</key>
			<string>Custom: (TSUCollaborationLogFilterLevel)</string>
			<key>PayloadEnabled</key>
			<true/>
			<key>PayloadIdentifier</key>
			<string>com.apple.mdm.30733CFF-A8C4-4855-90CF-E696C511E267.alacarte.customsettings.350B4683-D707-4BE7-AB76-45105FB34EE2</string>
			<key>PayloadType</key>
			<string>com.apple.ManagedClient.preferences</string>
			<key>PayloadUUID</key>
			<string>350B4683-D707-4BE7-AB76-45105FB34EE2</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
		</dict>
		<dict>
			<key>PayloadContent</key>
			<dict>
				<key>.GlobalPreferences</key>
				<dict>
					<key>Forced</key>
					<array>
						<dict>
							<key>mcx_preference_settings</key>
							<dict>
								<key>TSUCollaborationLogToFile</key>
								<string>YES</string>
							</dict>
						</dict>
					</array>
				</dict>
			</dict>
			<key>PayloadDisplayName</key>
			<string>Custom: (TSUCollaborationLogToFile)</string>
			<key>PayloadEnabled</key>
			<true/>
			<key>PayloadIdentifier</key>
			<string>com.apple.mdm.30733CFF-A8C4-4855-90CF-E696C511E267.alacarte.customsettings.F6B474B2-5636-4772-9E27-47699552C52F</string>
			<key>PayloadType</key>
			<string>com.apple.ManagedClient.preferences</string>
			<key>PayloadUUID</key>
			<string>F6B474B2-5636-4772-9E27-47699552C52F</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
		</dict>
		<dict>
			<key>PayloadContent</key>
			<dict>
				<key>com.apple.bird</key>
				<dict>
					<key>Forced</key>
					<array>
						<dict>
							<key>mcx_preference_settings</key>
							<dict>
								<key>log.level</key>
								<integer>7</integer>
							</dict>
						</dict>
					</array>
				</dict>
			</dict>
			<key>PayloadDisplayName</key>
			<string>Custom: (com.apple.bird)</string>
			<key>PayloadEnabled</key>
			<true/>
			<key>PayloadIdentifier</key>
			<string>com.apple.mdm.30733CFF-A8C4-4855-90CF-E696C511E267.alacarte.customsettings.DE15C52E-64A8-44E3-9F72-D7D6C1B2C56D</string>
			<key>PayloadType</key>
			<string>com.apple.ManagedClient.preferences</string>
			<key>PayloadUUID</key>
			<string>DE15C52E-64A8-44E3-9F72-D7D6C1B2C56D</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
		</dict>
		<dict>
			<key>PayloadContent</key>
			<dict>
				<key>.GlobalPreferences</key>
				<dict>
					<key>Forced</key>
					<array>
						<dict>
							<key>mcx_preference_settings</key>
							<dict>
								<key>com.apple.clouddocs.log.level</key>
								<integer>7</integer>
							</dict>
						</dict>
					</array>
				</dict>
			</dict>
			<key>PayloadDisplayName</key>
			<string>Custom: (com.apple.clouddocs.log.level)</string>
			<key>PayloadEnabled</key>
			<true/>
			<key>PayloadIdentifier</key>
			<string>com.apple.mdm.30733CFF-A8C4-4855-90CF-E696C511E267.alacarte.customsettings.E3B5B075-DCFD-4012-B47F-0828180C8953</string>
			<key>PayloadType</key>
			<string>com.apple.ManagedClient.preferences</string>
			<key>PayloadUUID</key>
			<string>E3B5B075-DCFD-4012-B47F-0828180C8953</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
		</dict>
		<dict>
			<key>PayloadContent</key>
			<dict>
				<key>com.apple.mmcs</key>
				<dict>
					<key>Forced</key>
					<array>
						<dict>
							<key>mcx_preference_settings</key>
							<dict>
								<key>DebugLevel</key>
								<string>4</string>
							</dict>
						</dict>
					</array>
				</dict>
			</dict>
			<key>PayloadDisplayName</key>
			<string>Custom: (com.apple.mmcs)</string>
			<key>PayloadEnabled</key>
			<true/>
			<key>PayloadIdentifier</key>
			<string>com.apple.mdm.30733CFF-A8C4-4855-90CF-E696C511E267.alacarte.customsettings.983CEAB3-FC35-49D1-BA72-D14805A54A7A</string>
			<key>PayloadType</key>
			<string>com.apple.ManagedClient.preferences</string>
			<key>PayloadUUID</key>
			<string>983CEAB3-FC35-49D1-BA72-D14805A54A7A</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
		</dict>
		<dict>
			<key>PayloadContent</key>
			<dict>
				<key>.GlobalPreferences</key>
				<dict>
					<key>Forced</key>
					<array>
						<dict>
							<key>mcx_preference_settings</key>
							<dict>
								<key>CKLogLevel</key>
								<integer>8</integer>
							</dict>
						</dict>
					</array>
				</dict>
			</dict>
			<key>PayloadDisplayName</key>
			<string>Custom: (CKLogLevel)</string>
			<key>PayloadEnabled</key>
			<true/>
			<key>PayloadIdentifier</key>
			<string>com.apple.mdm.30733CFF-A8C4-4855-90CF-E696C511E267.alacarte.customsettings.E3FE1702-0FC4-421C-B9BD-6D7818D48E48</string>
			<key>PayloadType</key>
			<string>com.apple.ManagedClient.preferences</string>
			<key>PayloadUUID</key>
			<string>E3FE1702-0FC4-421C-B9BD-6D7818D48E48</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
		</dict>
		<dict>
			<key>PayloadContent</key>
			<dict>
				<key>com.apple.accountsd</key>
				<dict>
					<key>Forced</key>
					<array>
						<dict>
							<key>mcx_preference_settings</key>
							<dict>
								<key>logLevel</key>
								<integer>7</integer>
							</dict>
						</dict>
					</array>
				</dict>
			</dict>
			<key>PayloadDisplayName</key>
			<string>Custom: (com.apple.accountsd)</string>
			<key>PayloadEnabled</key>
			<true/>
			<key>PayloadIdentifier</key>
			<string>com.apple.mdm.30733CFF-A8C4-4855-90CF-E696C511E267.alacarte.customsettings.5A68B11A-4106-4BC3-A048-1F12DFE9038C</string>
			<key>PayloadType</key>
			<string>com.apple.ManagedClient.preferences</string>
			<key>PayloadUUID</key>
			<string>5A68B11A-4106-4BC3-A048-1F12DFE9038C</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
		</dict>
		<dict>
			<key>PayloadContent</key>
			<dict>
				<key>.GlobalPreferences</key>
				<dict>
					<key>Forced</key>
					<array>
						<dict>
							<key>mcx_preference_settings</key>
							<dict>
								<key>com.apple.AOSKit.LogLevel</key>
								<integer>7</integer>
							</dict>
						</dict>
					</array>
				</dict>
			</dict>
			<key>PayloadDisplayName</key>
			<string>Custom: (com.apple.AOSKit.LogLevel)</string>
			<key>PayloadEnabled</key>
			<true/>
			<key>PayloadIdentifier</key>
			<string>com.apple.mdm.30733CFF-A8C4-4855-90CF-E696C511E267.alacarte.customsettings.FC5F5732-007E-465E-8A01-7E7188D0DDE9</string>
			<key>PayloadType</key>
			<string>com.apple.ManagedClient.preferences</string>
			<key>PayloadUUID</key>
			<string>FC5F5732-007E-465E-8A01-7E7188D0DDE9</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
		</dict>
		<dict>
			<key>PayloadContent</key>
			<dict>
				<key>.GlobalPreferences</key>
				<dict>
					<key>Forced</key>
					<array>
						<dict>
							<key>mcx_preference_settings</key>
							<dict>
								<key>com.apple.coredata.ubiquity.logLevel</key>
								<integer>3</integer>
							</dict>
						</dict>
					</array>
				</dict>
			</dict>
			<key>PayloadDisplayName</key>
			<string>Custom: (com.apple.coredata.ubiquity.logLevel)</string>
			<key>PayloadEnabled</key>
			<true/>
			<key>PayloadIdentifier</key>
			<string>com.apple.mdm.30733CFF-A8C4-4855-90CF-E696C511E267.alacarte.customsettings.8CC10767-22C9-4013-B93A-59401AC65BD7</string>
			<key>PayloadType</key>
			<string>com.apple.ManagedClient.preferences</string>
			<key>PayloadUUID</key>
			<string>8CC10767-22C9-4013-B93A-59401AC65BD7</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
		</dict>
		<dict>
			<key>PayloadIdentifier</key>
			<string>LoggingPayload</string>
			<key>PayloadType</key>
			<string>com.apple.system.logging</string>
			<key>PayloadUUID</key>
			<string>04A78F14-1E17-46EF-BAAB-E4654AB70D42</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
			<key>Subsystems</key>
			<dict>
				<key>com.apple.CloudDocsUI</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Default-Privacy-Setting</key>
						<string>Public</string>
						<key>Enable-Oversize-Messages</key>
						<true/>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Debug</string>
							<key>Persist</key>
							<string>Debug</string>
						</dict>
						<key>TTL</key>
						<dict>
							<key>Default</key>
							<integer>14</integer>
						</dict>
					</dict>
				</dict>
				<key>com.apple.clouddocs</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Default-Privacy-Setting</key>
						<string>Public</string>
						<key>Enable-Oversize-Messages</key>
						<true/>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Debug</string>
							<key>Persist</key>
							<string>Debug</string>
						</dict>
						<key>TTL</key>
						<dict>
							<key>Default</key>
							<integer>14</integer>
						</dict>
					</dict>
				</dict>
				<key>com.apple.cloudkit</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Default-Privacy-Setting</key>
						<string>Public</string>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Debug</string>
							<key>Persist</key>
							<string>Debug</string>
						</dict>
						<key>LogFacilityCK</key>
						<dict>
							<key>Enable-Oversize-Messages</key>
							<true/>
						</dict>
						<key>LogFacilityMMCS</key>
						<dict>
							<key>Enable-Oversize-Messages</key>
							<true/>
						</dict>
						<key>LogFacilityPCS</key>
						<dict>
							<key>Enable-Oversize-Messages</key>
							<true/>
						</dict>
						<key>LogFacilityRequest</key>
						<dict>
							<key>Enable-Oversize-Messages</key>
							<true/>
						</dict>
						<key>LogFacilitySQL</key>
						<dict>
							<key>Enable-Oversize-Messages</key>
							<true/>
						</dict>
						<key>TTL</key>
						<dict>
							<key>Default</key>
							<integer>14</integer>
						</dict>
					</dict>
				</dict>
				<key>com.apple.iwork</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Default-Privacy-Setting</key>
						<string>Public</string>
						<key>Enable-Oversize-Messages</key>
						<true/>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Debug</string>
							<key>Persist</key>
							<string>Debug</string>
						</dict>
						<key>TTL</key>
						<dict>
							<key>Default</key>
							<integer>14</integer>
						</dict>
					</dict>
				</dict>
				<key>com.apple.mmcs</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Default-Privacy-Setting</key>
						<string>Public</string>
						<key>Enable-Oversize-Messages</key>
						<true/>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Debug</string>
							<key>Persist</key>
							<string>Debug</string>
						</dict>
						<key>TTL</key>
						<dict>
							<key>Default</key>
							<integer>14</integer>
						</dict>
					</dict>
				</dict>
			</dict>
		</dict>
	</array>
	<key>PayloadDescription</key>
	<string>Enables iWork debug logging.</string>
	<key>PayloadDisplayName</key>
	<string>iWork Diagnostics Profile</string>
	<key>PayloadIdentifier</key>
	<string>com.apple.iWork.debug</string>
	<key>PayloadOrganization</key>
	<string>Apple Inc.</string>
	<key>PayloadType</key>
	<string>Configuration</string>
	<key>PayloadUUID</key>
	<string>2C569C3F-91EF-47CD-B4A0-758CA838F0BE</string>
	<key>PayloadVersion</key>
	<integer>1</integer>
	<key>RemovalDate</key>
	<date>2025-05-17T07:00:00Z</date>
</dict>
</plist>
