<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>ConsentText</key>
	<dict>
		<key>default</key>
		<string>The Location and Motion Logging Profile generates files that allow Apple to troubleshoot issues with your device and help Apple to improve its products and services. The generated files may contain some of your personal information, including contents of SMS's, device identifiers and names, phone numbers of the registering device, Apple IDs of the accounts into which you are signed, logs of incoming and outgoing calls and audio routes during the time the logging is enabled, location data, raw coordinate data, timestamps, battery status and usage, information about detected WiFi access points and Bluetooth devices, and motion data including raw motion sensor data, app usage, and apps' usage of location and motion. If you install this profile, it will automatically turn the logging on, and this data will be captured when you take a Sysdiagnose on this device. The data will not leave the device unless you initiate a Sysdiagnose and send the results. This profile will expire after 7 days.

You will be able to turn on and off logging at any time while the Profile is installed. To turn off logging on your iOS device, open Settings, tap General, tap "Profiles", tap "Location &amp; Motion Logging", and tap "Delete Profile."

By enabling this diagnostic tool and sending a copy of the generated files to Apple, you are consenting to Apple's use of the content of such files in accordance with its privacy policy (http://www.apple.com/legal/privacy).

Copyright © 2024, Apple Inc. All rights reserved.

Apple Confidential Profile. Do not distribute. Not to be used or disclosed without permission from Apple. Copyright © 2024, Apple Inc. All rights reserved.</string>
	</dict>
	<key>DurationUntilRemoval</key>
	<integer>604800</integer>
	<key>PayloadContent</key>
	<array>
		<dict>
			<key>PayloadDisplayName</key>
			<string>LocationAndMotionLogging</string>
			<key>PayloadIdentifier</key>
			<string>com.apple.locationd.carry.logging</string>
			<key>PayloadType</key>
			<string>com.apple.system.logging</string>
			<key>PayloadUUID</key>
			<string>4E9D2673-749A-47F3-838B-FA9CED623A3F</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
			<key>Subsystems</key>
			<dict>
				<key>com.apple.aonsensed</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Enable-Private-Data</key>
						<true/>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Debug</string>
							<key>Persist</key>
							<string>Debug</string>
						</dict>
					</dict>
				</dict>
				<key>com.apple.corenavigation</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Enable-Private-Data</key>
						<true/>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Debug</string>
							<key>Persist</key>
							<string>Debug</string>
						</dict>
					</dict>
				</dict>
				<key>com.apple.countryd</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Enable-Private-Data</key>
						<true/>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Info</string>
							<key>Persist</key>
							<string>Info</string>
						</dict>
					</dict>
				</dict>
				<key>com.apple.gpsd</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Enable-Private-Data</key>
						<true/>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Debug</string>
							<key>Persist</key>
							<string>Debug</string>
						</dict>
					</dict>
				</dict>
				<key>com.apple.locationd.Core</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Enable-Private-Data</key>
						<true/>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Debug</string>
							<key>Persist</key>
							<string>Debug</string>
						</dict>
					</dict>
				</dict>
				<key>com.apple.locationd.Country</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Enable-Private-Data</key>
						<true/>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Info</string>
							<key>Persist</key>
							<string>Info</string>
						</dict>
					</dict>
				</dict>
				<key>com.apple.locationd.Legacy</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Enable-Private-Data</key>
						<true/>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Debug</string>
							<key>Persist</key>
							<string>Debug</string>
						</dict>
					</dict>
				</dict>
				<key>com.apple.locationd.Motion</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Enable-Private-Data</key>
						<true/>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Info</string>
							<key>Persist</key>
							<string>Info</string>
						</dict>
					</dict>
					<key>Odometer</key>
					<dict>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Debug</string>
							<key>Persist</key>
							<string>Debug</string>
						</dict>
					</dict>
					<key>Pedometer</key>
					<dict>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Debug</string>
							<key>Persist</key>
							<string>Debug</string>
						</dict>
					</dict>
				</dict>
				<key>com.apple.locationd.Pipeline</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Enable-Private-Data</key>
						<true/>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Debug</string>
							<key>Persist</key>
							<string>Debug</string>
						</dict>
					</dict>
				</dict>
				<key>com.apple.locationd.Position</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Enable-Private-Data</key>
						<true/>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Debug</string>
							<key>Persist</key>
							<string>Debug</string>
						</dict>
					</dict>
					<key>NMEA</key>
					<dict>
						<key>Enable-Private-Data</key>
						<true/>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Debug</string>
							<key>Persist</key>
							<string>Debug</string>
						</dict>
					</dict>
					<key>PositionProto</key>
					<dict>
						<key>Enable-Private-Data</key>
						<true/>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Debug</string>
							<key>Persist</key>
							<string>Debug</string>
						</dict>
						<key>TTL</key>
						<dict>
							<key>Debug</key>
							<integer>1</integer>
							<key>Default</key>
							<integer>1</integer>
							<key>Info</key>
							<integer>1</integer>
						</dict>
					</dict>
				</dict>
				<key>com.apple.locationd.Utility</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Enable-Private-Data</key>
						<true/>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Debug</string>
							<key>Persist</key>
							<string>Debug</string>
						</dict>
					</dict>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>PayloadContent</key>
			<array>
				<dict>
					<key>DefaultsData</key>
					<dict>
						<key>EnableInterfaceTelemetry</key>
						<true/>
						<key>EnableProtobufBinaryLog</key>
						<true/>
						<key>LogLevel</key>
						<integer>6</integer>
						<key>ProtobufLogDirectory</key>
						<string>/var/mobile/Library/Logs/CrashReporter/gpsd</string>
						<key>VendorLogDirectory</key>
						<string>/var/mobile/Library/Logs/CrashReporter/gpsd</string>
						<key>VendorLogMaxDirectorySizeMB</key>
						<integer>1000</integer>
					</dict>
					<key>DefaultsDomainName</key>
					<string>gpsd</string>
				</dict>
				<dict>
					<key>DefaultsData</key>
					<dict>
						<key>EnableFenceLogEntryRecorder</key>
						<true/>
						<key>EnableLocationControllerRecorder</key>
						<true/>
						<key>EnableRavenRecorder</key>
						<true/>
						<key>EnableTrackRunRecorder</key>
						<true/>
						<key>EnableVisionRecorder</key>
						<true/>
						<key>WriteLocationdLogsToCrashReporterFolder</key>
						<true/>
						<key>WriteRavenLogsToCrashReporterFolder</key>
						<true/>
						<key>WriteVisionLogsToCrashReporterFolder</key>
						<true/>
					</dict>
					<key>DefaultsDomainName</key>
					<string>com.apple.locationd</string>
				</dict>
			</array>
			<key>PayloadIdentifier</key>
			<string>com.apple.gpsd.loggingprofile</string>
			<key>PayloadType</key>
			<string>com.apple.defaults.managed</string>
			<key>PayloadUUID</key>
			<string>9BCA0287-F41A-472E-B72C-3FEA6C06D4CE</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
		</dict>
		<dict>
			<key>PayloadContent</key>
			<array>
				<dict>
					<key>DefaultsData</key>
					<dict>
						<key>AllowTelephonyLoggingUI</key>
						<true/>
						<key>EnableBasebandLogging</key>
						<dict>
							<key>History</key>
							<integer>12</integer>
							<key>Profile</key>
							<integer>2</integer>
							<key>Sleep</key>
							<integer>0</integer>
						</dict>
						<key>EnableTelephonyLogging</key>
						<true/>
					</dict>
					<key>DefaultsDomainName</key>
					<string>com.apple.commcenter</string>
				</dict>
			</array>
			<key>PayloadDescription</key>
			<string>Enables Telephony Logging</string>
			<key>PayloadDisplayName</key>
			<string>Telephony Diagnostics</string>
			<key>PayloadIdentifier</key>
			<string>com.apple.commcenter</string>
			<key>PayloadOrganization</key>
			<string>Apple Inc.</string>
			<key>PayloadType</key>
			<string>com.apple.defaults.managed</string>
			<key>PayloadUUID</key>
			<string>8F32C383-83BF-4F53-8FEB-B09EC96EC426</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
		</dict>
	</array>
	<key>PayloadDescription</key>
	<string>Increases logging to facilitate troubleshooting location issues.</string>
	<key>PayloadDisplayName</key>
	<string>LocationAndMotionLogging</string>
	<key>PayloadIdentifier</key>
	<string>com.apple.locationd.customer</string>
	<key>PayloadOrganization</key>
	<string>Apple Inc.</string>
	<key>PayloadRebootSuggested</key>
	<true/>
	<key>PayloadRemovalDisallowed</key>
	<false/>
	<key>PayloadScope</key>
	<string>System</string>
	<key>PayloadType</key>
	<string>Configuration</string>
	<key>PayloadUUID</key>
	<string>A2DB91E4-0B7C-4139-8E0A-A5B8DD0ED55D</string>
	<key>PayloadVersion</key>
	<integer>1</integer>
	<key>RemovalDate</key>
	<date>2025-08-23T07:00:00Z</date>
</dict>
</plist>
