<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>ConsentText</key>
	<dict>
		<key>default</key>
		<string>The Performance Tracing Diagnostics profile generates files that allow Apple to troubleshoot issues with your device and help Apple to improve its products and services.  The generated files may contain some of your personal information, including the names of files accessed on the device, a list of running applications, and the internal states of running applications which may reveal how you are using them.  If you install this profile, data will not be captured by default and will only be captured when you manually start tracing on this device using Control Center. Generated traces may not be more than 30 seconds in length. The generated data will not leave the device unless you share the results manually or transfer your logs to a host. The profile will expire after 7 days.

You will be able to disable this feature at any time while the Profile is installed. To turn off this feature on your iOS device, open Settings, tap General, tap "Profiles", tap "Performance Tracing Diagnostics", and tap "Delete Profile".

By enabling this diagnostic tool and sending a copy of the generated files to Apple, you are consenting to Apple's use of the content of such files in accordance with its privacy policy (http://www.apple.com/legal/privacy).

Apple Confidential Profile. Do not distribute. Not to be used or disclosed without permission from Apple. Copyright © 2024, Apple Inc. All rights reserved.</string>
	</dict>
	<key>DurationUntilRemoval</key>
	<real>604800.0</real>
	<key>PayloadContent</key>
	<array>
		<dict>
			<key>PayloadContent</key>
			<array>
				<dict>
					<key>DefaultsData</key>
					<dict>
						<key>SBIconVisibility</key>
						<integer>1</integer>
					</dict>
					<key>DefaultsDomainName</key>
					<string>com.apple.control-center.PerformanceTraceModule</string>
				</dict>
			</array>
			<key>PayloadIdentifier</key>
			<string>com.apple.defaults.1</string>
			<key>PayloadType</key>
			<string>com.apple.defaults.managed</string>
			<key>PayloadUUID</key>
			<string>7D09C52C-7AC6-4C79-9B44-1111C54BCE20</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
		</dict>
	</array>
	<key>PayloadDescription</key>
	<string>Performance Tracing Diagnostics</string>
	<key>PayloadDisplayName</key>
	<string>Performance Tracing Diagnostics</string>
	<key>PayloadIdentifier</key>
	<string>com.apple.mobileconfig.performancetrace</string>
	<key>PayloadOrganization</key>
	<string>Apple Inc.</string>
	<key>PayloadRebootSuggested</key>
	<true/>
	<key>PayloadType</key>
	<string>Configuration</string>
	<key>PayloadUUID</key>
	<string>300663B6-A816-4A9E-B36E-3E6CD8A2D834</string>
	<key>PayloadVersion</key>
	<integer>1</integer>
	<key>RemovalDate</key>
	<date>2025-06-22T07:00:00Z</date>
</dict>
</plist>
