<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>ConsentText</key>
	<dict>
		<key>default</key>
		<string>The Spotlight Diagnostics Profile generates files that allow Apple to troubleshoot issues related to Spotlight searches on your iOS device. The generated files may include information related to searches you have performed in Spotlight, including terms you searched and the results shown, such as: file names, contacts, email headers, first party and third party app data and web results. The generated files may include personal information related to you and any contacts, senders of messages and emails, including: your full names, email addresses, phone numbers and the content of your communications. The profile will expire after 14 days.

You will be able to turn logging on and off at any time while the Profile is installed, and will be able to review the log files on your computer prior to sending them to Apple. To turn off logging on your iOS device, open Settings, tap "General", tap "Profile", tap "Spotlight Diagnostics Profile" and then tap "Remove Profile".

By enabling this diagnostic tool and sending a copy of the generated files to Apple, you are consenting to Apple's use of the content of such files in accordance with its privacy policy (http://www.apple.com/legal/privacy).

Apple Confidential Profile. Do not distribute. Not to be used or disclosed without permission from Apple. Copyright © 2024, Apple Inc. All rights reserved.</string>
	</dict>
	<key>DurationUntilRemoval</key>
	<real>1209600.0</real>
	<key>PayloadContent</key>
	<array>
		<dict>
			<key>PayloadContent</key>
			<array>
				<dict>
					<key>DefaultsData</key>
					<dict>
						<key>CSLogDetailedActivity</key>
						<true/>
						<key>CSLogToConsole</key>
						<true/>
						<key>CSLogToFile</key>
						<true/>
						<key>SPLogLevel</key>
						<integer>7</integer>
						<key>SPOutputLevel</key>
						<integer>7</integer>
					</dict>
					<key>DefaultsDomainName</key>
					<string>.GlobalPreferences</string>
				</dict>
			</array>
			<key>PayloadIdentifier</key>
			<string>com.apple.defaults.1</string>
			<key>PayloadType</key>
			<string>com.apple.defaults.managed</string>
			<key>PayloadUUID</key>
			<string>14802A05-6E1B-4853-B291-4CB049C77091</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
		</dict>
		<dict>
			<key>PayloadIdentifier</key>
			<string>LoggingPayload</string>
			<key>PayloadType</key>
			<string>com.apple.system.logging</string>
			<key>PayloadUUID</key>
			<string>70107F97-77FB-4A85-8E1F-C5CAE5139C65</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
			<key>Subsystems</key>
			<dict>
				<key>com.apple.corespotlight</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Default-Privacy-Setting</key>
						<string>Public</string>
						<key>Enable-Oversize-Messages</key>
						<true/>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Debug</string>
							<key>Persist</key>
							<string>Debug</string>
						</dict>
						<key>TTL</key>
						<dict>
							<key>Default</key>
							<integer>14</integer>
						</dict>
					</dict>
				</dict>
				<key>com.apple.spotlight</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Default-Privacy-Setting</key>
						<string>Public</string>
						<key>Enable-Oversize-Messages</key>
						<true/>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Debug</string>
							<key>Persist</key>
							<string>Debug</string>
						</dict>
						<key>TTL</key>
						<dict>
							<key>Default</key>
							<integer>14</integer>
						</dict>
					</dict>
				</dict>
				<key>com.apple.spotlightindex</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Default-Privacy-Setting</key>
						<string>Public</string>
						<key>Enable-Oversize-Messages</key>
						<true/>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Debug</string>
							<key>Persist</key>
							<string>Debug</string>
						</dict>
						<key>TTL</key>
						<dict>
							<key>Default</key>
							<integer>14</integer>
						</dict>
					</dict>
				</dict>
				<key>com.apple.useractivity</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Default-Privacy-Setting</key>
						<string>Public</string>
						<key>Enable-Oversize-Messages</key>
						<true/>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Debug</string>
							<key>Persist</key>
							<string>Debug</string>
						</dict>
						<key>TTL</key>
						<dict>
							<key>Default</key>
							<integer>14</integer>
						</dict>
					</dict>
				</dict>
			</dict>
		</dict>
	</array>
	<key>PayloadDescription</key>
	<string>Enables Spotlight diagnostic logging.</string>
	<key>PayloadDisplayName</key>
	<string>Spotlight Diagnostics Profile</string>
	<key>PayloadIdentifier</key>
	<string>com.apple.Spotlight.logging.profile</string>
	<key>PayloadOrganization</key>
	<string>Apple Inc.</string>
	<key>PayloadType</key>
	<string>Configuration</string>
	<key>PayloadUUID</key>
	<string>14A86FE2-5E2C-434E-B0BC-A84F5D4628F6</string>
	<key>PayloadVersion</key>
	<integer>1</integer>
	<key>RemovalDate</key>
	<date>2025-10-11T07:00:00Z</date>
</dict>
</plist>
