<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>ConsentText</key>
	<dict>
		<key>default</key>
		<string>The Swift Previews Diagnostics profile generates files that allow Apple to troubleshoot issues with your device and help Apple to improve its products and services. The generated files may contain some of your development related information such as project and file names; declared classes, structs and enums; and function names. The files may also contain information about your device and OS version. The profile will expire after 3 days.

You will be able to review the log files on your computer prior to sending them to Apple. To turn off logging, open Settings, tap General, tap "Device Management", tap "Previews Logging Profile", and tap "Delete Profile".

By enabling Previews Diagnostics and submitting the generated files to Apple, you agree and consent to Apple's and its subsidiaries' and agents' transmission, collection, maintenance, processing and use of this information as described above.

At all times, information received by Apple will be treated in accordance with Apple's Privacy Policy, which can be found at www.apple.com/privacy.

Apple Confidential Profile. Do not distribute. Not to be used or disclosed without permission from Apple. Copyright © 2024, Apple Inc. All rights reserved.</string>
	</dict>
	<key>DurationUntilRemoval</key>
	<real>259200.0</real>
	<key>PayloadContent</key>
	<array>
		<dict>
			<key>PayloadIdentifier</key>
			<string>com.apple.SwiftPreviews.logging.1</string>
			<key>PayloadType</key>
			<string>com.apple.system.logging</string>
			<key>PayloadUUID</key>
			<string>F60E9701-561D-4AF7-A547-F3A2D5E5B8B6</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
			<key>Subsystems</key>
			<dict>
				<key>com.apple.dt.Previews</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Default-Privacy-Setting</key>
						<string>Public</string>
						<key>Enable-Oversize-Messages</key>
						<true/>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Debug</string>
							<key>Persist</key>
							<string>Debug</string>
						</dict>
						<key>Persist</key>
						<string>Debug</string>
					</dict>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>PayloadIdentifier</key>
			<string>com.apple.XOJIT.logging.1</string>
			<key>PayloadType</key>
			<string>com.apple.system.logging</string>
			<key>PayloadUUID</key>
			<string>24FEE5B1-6086-4742-B9AF-6A44DD2E5A25</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
			<key>Subsystems</key>
			<dict>
				<key>com.apple.XOJIT</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Default-Privacy-Setting</key>
						<string>Public</string>
						<key>Enable-Oversize-Messages</key>
						<true/>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Debug</string>
							<key>Persist</key>
							<string>Debug</string>
						</dict>
						<key>Persist</key>
						<string>Debug</string>
					</dict>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>PayloadIdentifier</key>
			<string>com.apple.RunningBoard.logging.1</string>
			<key>PayloadType</key>
			<string>com.apple.system.logging</string>
			<key>PayloadUUID</key>
			<string>372AA51D-9D64-458C-95FE-77DE02A0D895</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
			<key>Subsystems</key>
			<dict>
				<key>com.apple.runningboard</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Default-Privacy-Setting</key>
						<string>Public</string>
						<key>Enable-Oversize-Messages</key>
						<true/>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Default</string>
							<key>Persist</key>
							<string>Default</string>
						</dict>
						<key>Persist</key>
						<string>Default</string>
					</dict>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>PayloadIdentifier</key>
			<string>com.apple.BoardServices.logging.1</string>
			<key>PayloadType</key>
			<string>com.apple.system.logging</string>
			<key>PayloadUUID</key>
			<string>C5193FF7-CA50-43DC-9578-750535E351D5</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
			<key>Subsystems</key>
			<dict>
				<key>com.apple.BoardServices</key>
				<dict>
					<key>Bootstrap</key>
					<dict>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Info</string>
							<key>Persist</key>
							<string>Info</string>
						</dict>
						<key>Persist</key>
						<string>Info</string>
					</dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Default-Privacy-Setting</key>
						<string>Public</string>
						<key>Enable-Oversize-Messages</key>
						<true/>
					</dict>
					<key>Injection</key>
					<dict>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Info</string>
							<key>Persist</key>
							<string>Info</string>
						</dict>
						<key>Persist</key>
						<string>Info</string>
					</dict>
					<key>XPCErrors</key>
					<dict>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Info</string>
							<key>Persist</key>
							<string>Info</string>
						</dict>
						<key>Persist</key>
						<string>Info</string>
					</dict>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>PayloadIdentifier</key>
			<string>com.apple.FrontBoard.logging.1</string>
			<key>PayloadType</key>
			<string>com.apple.system.logging</string>
			<key>PayloadUUID</key>
			<string>6911BB66-0FCC-4432-AB2E-009F6A881260</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
			<key>Subsystems</key>
			<dict>
				<key>com.apple.FrontBoard</key>
				<dict>
					<key>Common</key>
					<dict>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Default</string>
							<key>Persist</key>
							<string>Default</string>
						</dict>
						<key>Persist</key>
						<string>Default</string>
					</dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Default-Privacy-Setting</key>
						<string>Public</string>
						<key>Enable-Oversize-Messages</key>
						<true/>
					</dict>
					<key>Process</key>
					<dict>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Default</string>
							<key>Persist</key>
							<string>Default</string>
						</dict>
						<key>Persist</key>
						<string>Default</string>
					</dict>
					<key>ProcessScene</key>
					<dict>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Default</string>
							<key>Persist</key>
							<string>Default</string>
						</dict>
						<key>Persist</key>
						<string>Default</string>
					</dict>
					<key>ProcessWorkspace</key>
					<dict>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Default</string>
							<key>Persist</key>
							<string>Default</string>
						</dict>
						<key>Persist</key>
						<string>Default</string>
					</dict>
					<key>Scene</key>
					<dict>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Default</string>
							<key>Persist</key>
							<string>Default</string>
						</dict>
						<key>Persist</key>
						<string>Default</string>
					</dict>
				</dict>
			</dict>
		</dict>
	</array>
	<key>PayloadDescription</key>
	<string>Enables logging for Swift Previews</string>
	<key>PayloadDisplayName</key>
	<string>Swift Previews Logging Profile</string>
	<key>PayloadIdentifier</key>
	<string>com.apple.SwiftPreviews.logging</string>
	<key>PayloadOrganization</key>
	<string>Apple Inc.</string>
	<key>PayloadRebootSuggested</key>
	<true/>
	<key>PayloadScope</key>
	<string>System</string>
	<key>PayloadType</key>
	<string>Configuration</string>
	<key>PayloadUUID</key>
	<string>F2BD0267-FA5A-40E9-99BF-F7797DCC904A</string>
	<key>PayloadVersion</key>
	<integer>1</integer>
	<key>RemovalDate</key>
	<date>2025-03-06T08:00:00Z</date>
</dict>
</plist>
