<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>ConsentText</key>
	<dict>
		<key>default</key>
		<string>The Wallet and Apple Pay Diagnostics profile generates files that allow Apple to troubleshoot issues with your device and help Apple to improve its products and services. The generated files may contain some of your personal information, including information about your Wallet and Apple Pay usage while you have this profile installed, such as the names of the passes in your Wallet, your location when using Wallet, transaction data, unique identifiers which are used to push Wallet notifications to your device, the number of payment cards set up on your account, transaction status or error information, and a unique hardware identifier for your device. The generated files will not otherwise contain any of the content of your Passes. The profile will expire after 3 days.

You will be able to review the log files on your computer prior to sending them to Apple. To turn off logging, open Settings, tap General, tap "Device Management", tap "Wallet and Apple Pay Logging Profile", and tap "Delete Profile".

By enabling Wallet and Apple Pay Diagnostics and submitting the generated files to Apple, you agree and consent to Apple's and its subsidiaries' and agents' transmission, collection, maintenance, processing and use of this information as described above.

At all times, information received by Apple will be treated in accordance with Apple's Privacy Policy, which can be found at www.apple.com/privacy.

Apple Confidential Profile. Do not distribute. Not to be used or disclosed without permission from Apple. Copyright © 2024, Apple Inc. All rights reserved.</string>
	</dict>
	<key>DurationUntilRemoval</key>
	<real>259200.0</real>
	<key>PayloadContent</key>
	<array>
		<dict>
			<key>PayloadIdentifier</key>
			<string>com.apple.wallet.logging.1</string>
			<key>PayloadType</key>
			<string>com.apple.system.logging</string>
			<key>PayloadUUID</key>
			<string>9F1F9695-DC16-4537-AF27-24493DC192E1</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
			<key>Subsystems</key>
			<dict>
				<key>com.apple.FinanceKit</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Default-Privacy-Setting</key>
						<string>Public</string>
						<key>Enable-Oversize-Messages</key>
						<true/>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Debug</string>
							<key>Persist</key>
							<string>Debug</string>
						</dict>
					</dict>
				</dict>
				<key>com.apple.passkit</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Default-Privacy-Setting</key>
						<string>Public</string>
						<key>Enable-Oversize-Messages</key>
						<true/>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Debug</string>
							<key>Persist</key>
							<string>Debug</string>
						</dict>
						<key>Persist</key>
						<string>Debug</string>
					</dict>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>PayloadIdentifier</key>
			<string>com.apple.nfc.logging.1</string>
			<key>PayloadType</key>
			<string>com.apple.system.logging</string>
			<key>PayloadUUID</key>
			<string>26A476E-ED3A-4AF5-BCF3-C546BB495C46</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
			<key>Subsystems</key>
			<dict>
				<key>com.apple.nfc</key>
				<dict>
					<key>LogAPDU</key>
					<true/>
					<key>LogNCI</key>
					<true/>
					<key>LogRF</key>
					<integer>4</integer>
					<key>LogTSM</key>
					<true/>
					<key>LogTransactionDetails</key>
					<true/>
					<key>Logging</key>
					<dict>
						<key>Default-Privacy-Setting</key>
						<string>Public</string>
						<key>Enable</key>
						<string>Debug</string>
						<key>Enable-Oversize-Messages</key>
						<true/>
						<key>Persist</key>
						<string>Debug</string>
					</dict>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>PayloadIdentifier</key>
			<string>com.apple.coreidv.logging.1</string>
			<key>PayloadType</key>
			<string>com.apple.system.logging</string>
			<key>PayloadUUID</key>
			<string>27B49654-DEBD-4868-B6B6-14AAE617C0CD</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
			<key>Subsystems</key>
			<dict>
				<key>com.apple.CoreIDV</key>
				<dict>
					<key>DEFAULT-OPTIONS</key>
					<dict>
						<key>Enable-Oversize-Messages</key>
						<true/>
						<key>Level</key>
						<dict>
							<key>Enable</key>
							<string>Debug</string>
							<key>Persist</key>
							<string>Debug</string>
						</dict>
					</dict>
				</dict>
			</dict>
		</dict>
	</array>
	<key>PayloadDescription</key>
	<string>Enables logging for Wallet and Apple Pay</string>
	<key>PayloadDisplayName</key>
	<string>Wallet and Apple Pay Logging Profile</string>
	<key>PayloadIdentifier</key>
	<string>com.apple.wallet.logging</string>
	<key>PayloadOrganization</key>
	<string>Apple Inc.</string>
	<key>PayloadRebootSuggested</key>
	<true/>
	<key>PayloadType</key>
	<string>Configuration</string>
	<key>PayloadUUID</key>
	<string>B99357FF-2F9D-4E82-9BB3-6ED7C9CDD6DB</string>
	<key>PayloadVersion</key>
	<integer>1</integer>
	<key>RemovalDate</key>
	<date>2025-02-28T08:00:00Z</date>
</dict>
</plist>
